{
  "version": "1.0",
  "truncation": null,
  "padding": null,
  "added_tokens": [
    {
      "id": 0,
      "content": "<pad>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 1,
      "content": "<sos>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 2,
      "content": "<eos>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 3,
      "content": "<unk>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 4,
      "content": "<tb>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 5,
      "content": "</tb>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 6,
      "content": "<col>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    }
  ],
  "normalizer": null,
  "pre_tokenizer": null,
  "post_processor": null,
  "decoder": null,
  "model": {
    "type": "WordLevel",
    "vocab": {
      "<pad>": 0,
      "<sos>": 1,
      "<eos>": 2,
      "<unk>": 3,
      "<tb>": 4,
      "</tb>": 5,
      "<col>": 6,
      "source_file(select_statement)": 7,
      "from_clause(join_table_1)": 8,
      "binary_expression(identifier, range_operator, number)": 9,
      "binary_expression(identifier, =, identifier)": 10,
      "select_clause_body(asterisk_expression(*))": 11,
      "from_clause(identifier)": 12,
      "where_clause(WHERE, boolean_expression(binary_expression, AND, boolean_expression))": 13,
      "join_clause(identifier, JOIN, identifier, join_condition(ON, binary_expression(identifier, =, identifier)))": 14,
      "limit_clause(LIMIT, number)": 15,
      "is_expression(identifier, IS, NULL)": 16,
      "in_expression(identifier, IN, tuple)": 17,
      "binary_expression(identifier, !=, number)": 18,
      "binary_expression(identifier, =, number)": 19,
      "select_statement(select_clause, from_clause, where_clause)": 20,
      "select_clause_body(identifier)": 21,
      "order_by_clause(order_expression(identifier))": 22,
      "order_by_clause(order_expression(identifier, DESC))": 23,
      "from_clause(join_table_2)": 24,
      "tuple(number)": 25,
      "between_expression(identifier, BETWEEN, number, AND, number)": 26,
      "select_statement(select_clause, from_clause, where_clause, limit_clause)": 27,
      "select_statement(select_clause, from_clause, where_clause, order_by_clause)": 28,
      "select_statement(set_select_statement)": 29,
      "boolean_expression(binary_expression(identifier, =, identifier), AND, boolean_expression(binary_expression, AND, boolean_expression))": 30,
      "where_clause(WHERE, binary_expression(identifier, range_operator, number))": 31,
      "binary_expression(identifier, =, string)": 32,
      "binary_expression(interval_expression, arithmetic_operator, time)": 33,
      "binary_expression(identifier, !=, string)": 34,
      "join_clause(join_clause, JOIN, identifier, join_condition(ON, binary_expression(identifier, =, identifier)))": 35,
      "where_clause(WHERE, boolean_expression(binary_expression, OR, boolean_expression))": 36,
      "boolean_expression(binary_expression(identifier, =, identifier), AND, boolean_expression(binary_expression, OR, boolean_expression))": 37,
      "binary_expression(identifier, LIKE, string)": 38,
      "where_clause(WHERE, boolean_expression(binary_expression, AND, binary_expression))": 39,
      "tuple(string)": 40,
      "boolean_expression(binary_expression(identifier, range_operator, number), AND, binary_expression(identifier, range_operator, number))": 41,
      "boolean_expression(binary_expression(identifier, range_operator, number), OR, boolean_expression(binary_expression, OR, boolean_expression))": 42,
      "select_statement(select_clause, from_clause, where_clause, order_by_clause, limit_clause)": 43,
      "boolean_expression(NOT, is_expression)": 44,
      "select_clause_body(function_call(COUNT))": 45,
      "boolean_expression(binary_expression(identifier, range_operator, number), AND, boolean_expression(binary_expression, AND, boolean_expression))": 46,
      "binary_expression(identifier, range_operator, binary_expression(interval_expression, arithmetic_operator, time))": 47,
      "boolean_expression(NOT, in_expression)": 48,
      "select_clause_body(number)": 49,
      "binary_expression(identifier, arithmetic_operator, identifier)": 50,
      "group_by_clause(group_expression(identifier))": 51,
      "exists_expression(EXISTS, select_subexpression)": 52,
      "select_clause_body(conditional_expression)": 53,
      "boolean_expression(binary_expression(identifier, range_operator, number), AND, boolean_expression(binary_expression, AND, binary_expression))": 54,
      "function_call(COUNT, asterisk_expression(*))": 55,
      "boolean_expression(binary_expression(identifier, range_operator, number), OR, binary_expression(identifier, range_operator, number))": 56,
      "select_clause_body(string)": 57,
      "binary_expression(identifier, arithmetic_operator, number)": 58,
      "boolean_expression(binary_expression(identifier, =, identifier), AND, binary_expression(identifier, range_operator, number))": 59,
      "boolean_expression(NOT, between_expression)": 60,
      "select_clause_body(function_call(SUM))": 61,
      "select_clause_body(function_call(MAX))": 62,
      "select_clause_body(function_call(AVG))": 63,
      "select_clause_body(function_call(MIN))": 64,
      "select_subexpression(select_statement(select_clause, from_clause, where_clause))": 65,
      "boolean_expression(binary_expression(identifier, =, identifier), AND, boolean_expression(boolean_expression, OR, boolean_expression))": 66,
      "where_clause(WHERE, boolean_expression(boolean_expression, OR, boolean_expression))": 67,
      "set_select_statement(select_statement, UNION, ALL, select_statement)": 68,
      "set_select_statement(select_statement, EXCEPT, ALL, select_statement)": 69,
      "set_select_statement(select_statement, EXCEPT, select_statement)": 70,
      "set_select_statement(select_statement, UNION, select_statement)": 71,
      "set_select_statement(select_statement, INTERSECT, ALL, select_statement)": 72,
      "set_select_statement(select_statement, INTERSECT, select_statement)": 73,
      "boolean_expression(binary_expression(identifier, =, identifier), AND, boolean_expression(binary_expression, AND, binary_expression))": 74,
      "boolean_expression(binary_expression(identifier, range_operator, number), OR, boolean_expression(binary_expression, OR, binary_expression))": 75,
      "where_clause(WHERE, boolean_expression(binary_expression, OR, binary_expression))": 76,
      "binary_expression(binary_expression(identifier, arithmetic_operator, number), arithmetic_operator, identifier)": 77,
      "boolean_expression(binary_expression(identifier, !=, number), AND, binary_expression(identifier, range_operator, number))": 78,
      "select_clause_body(time)": 79,
      "boolean_expression(binary_expression(identifier, range_operator, number), AND, is_expression)": 80,
      "boolean_expression(binary_expression(identifier, =, number), AND, binary_expression(identifier, range_operator, number))": 81,
      "function_call(MAX, identifier)": 82,
      "function_call(AVG, identifier)": 83,
      "function_call(COUNT, identifier)": 84,
      "function_call(MIN, identifier)": 85,
      "function_call(SUM, identifier)": 86,
      "from_clause(select_subexpression)": 87,
      "boolean_expression(binary_expression(identifier, range_operator, number), OR, boolean_expression(boolean_expression, OR, boolean_expression))": 88,
      "boolean_expression(binary_expression(identifier, range_operator, number), AND, in_expression)": 89,
      "select_statement(with_clause, select_clause, from_clause, where_clause)": 90,
      "boolean_expression(NOT, exists_expression)": 91,
      "select_subexpression(select_statement(select_clause, from_clause, where_clause, limit_clause))": 92,
      "from_clause(join_table_3)": 93,
      "where_clause(WHERE, boolean_expression(boolean_expression, AND, boolean_expression))": 94,
      "where_clause(WHERE, binary_expression(identifier, !=, number))": 95,
      "boolean_expression(NOT, binary_expression(identifier, LIKE, string))": 96,
      "where_clause(WHERE, binary_expression(identifier, =, number))": 97,
      "with_clause(cte(identifier, AS, select_statement(select_clause, from_clause, where_clause)))": 98,
      "select_subexpression(select_statement(select_clause, from_clause, where_clause, order_by_clause))": 99,
      "boolean_expression(binary_expression(identifier, =, identifier), AND, boolean_expression(binary_expression, OR, binary_expression))": 100,
      "boolean_expression(binary_expression(identifier, =, number), OR, boolean_expression(binary_expression, OR, boolean_expression))": 101,
      "boolean_expression(binary_expression(identifier, !=, number), OR, boolean_expression(binary_expression, OR, boolean_expression))": 102,
      "where_clause(WHERE, boolean_expression(boolean_expression, AND, exists_expression))": 103,
      "boolean_expression(boolean_expression(binary_expression, OR, boolean_expression), OR, is_expression)": 104,
      "where_clause(WHERE, is_expression)": 105,
      "binary_expression(binary_expression(binary_expression, arithmetic_operator, identifier), range_operator, number)": 106,
      "select_statement(with_clause, select_clause, from_clause, where_clause, limit_clause)": 107,
      "boolean_expression(binary_expression(identifier, =, number), AND, boolean_expression(binary_expression, AND, boolean_expression))": 108,
      "boolean_expression(binary_expression(identifier, !=, number), OR, binary_expression(identifier, range_operator, number))": 109,
      "boolean_expression(binary_expression(identifier, =, number), OR, binary_expression(identifier, range_operator, number))": 110,
      "boolean_expression(binary_expression(identifier, !=, number), AND, boolean_expression(binary_expression, AND, boolean_expression))": 111,
      "where_clause(WHERE, in_expression)": 112,
      "binary_expression(binary_expression(identifier, arithmetic_operator, identifier), range_operator, number)": 113,
      "binary_expression(identifier, =, binary_expression(interval_expression, arithmetic_operator, time))": 114,
      "boolean_expression(boolean_expression(binary_expression, AND, boolean_expression), AND, is_expression)": 115,
      "binary_expression(identifier, !=, binary_expression(interval_expression, arithmetic_operator, time))": 116,
      "boolean_expression(boolean_expression(binary_expression, OR, boolean_expression), OR, in_expression)": 117,
      "boolean_expression(between_expression, AND, binary_expression(identifier, range_operator, number))": 118,
      "boolean_expression(binary_expression(identifier, range_operator, number), OR, boolean_expression(binary_expression, AND, binary_expression))": 119,
      "select_statement(with_clause, select_clause, from_clause, where_clause, order_by_clause)": 120,
      "binary_expression(binary_expression(identifier, arithmetic_operator, identifier), arithmetic_operator, number)": 121,
      "boolean_expression(binary_expression(identifier, =, string), AND, binary_expression(identifier, range_operator, number))": 122,
      "boolean_expression(binary_expression(identifier, range_operator, number), OR, is_expression)": 123,
      "boolean_expression(binary_expression(identifier, !=, string), AND, binary_expression(identifier, range_operator, number))": 124,
      "with_clause(cte(identifier, AS, select_statement(select_clause, from_clause, where_clause, limit_clause)))": 125,
      "where_clause(WHERE, boolean_expression(binary_expression, AND, is_expression))": 126,
      "boolean_expression(boolean_expression(binary_expression, AND, boolean_expression), AND, in_expression)": 127,
      "boolean_expression(binary_expression(identifier, range_operator, number), OR, boolean_expression(binary_expression, AND, boolean_expression))": 128,
      "boolean_expression(binary_expression(identifier, range_operator, number), OR, in_expression)": 129,
      "select_subexpression(select_statement(select_clause, from_clause, where_clause, order_by_clause, limit_clause))": 130,
      "select_statement(select_clause, from_clause, where_clause, group_by_clause)": 131,
      "where_clause(WHERE, boolean_expression(binary_expression, AND, in_expression))": 132,
      "with_clause(cte(identifier, AS, select_statement(select_clause, from_clause, where_clause, order_by_clause)))": 133,
      "boolean_expression(binary_expression(identifier, range_operator, number), AND, boolean_expression(boolean_expression, AND, boolean_expression))": 134,
      "conditional_expression(CASE, identifier, WHEN, number, THEN, identifier, END)": 135,
      "with_clause(cte(identifier, AS, select_statement(set_select_statement)))": 136,
      "boolean_expression(boolean_expression(binary_expression, AND, binary_expression), OR, boolean_expression(binary_expression, OR, boolean_expression))": 137,
      "boolean_expression(binary_expression(identifier, =, identifier), AND, is_expression)": 138,
      "boolean_expression(binary_expression(identifier, =, string), OR, boolean_expression(binary_expression, OR, boolean_expression))": 139,
      "boolean_expression(binary_expression(identifier, !=, string), OR, boolean_expression(binary_expression, OR, boolean_expression))": 140,
      "boolean_expression(binary_expression(identifier, range_operator, number), OR, boolean_expression(boolean_expression, OR, is_expression))": 141,
      "boolean_expression(binary_expression(identifier, =, string), AND, boolean_expression(binary_expression, AND, boolean_expression))": 142,
      "where_clause(WHERE, between_expression)": 143,
      "boolean_expression(binary_expression(identifier, !=, string), AND, boolean_expression(binary_expression, AND, boolean_expression))": 144,
      "boolean_expression(binary_expression(identifier, =, identifier), AND, in_expression)": 145,
      "select_statement(with_clause, select_clause, from_clause, where_clause, order_by_clause, limit_clause)": 146,
      "boolean_expression(boolean_expression(binary_expression, AND, boolean_expression), OR, boolean_expression(binary_expression, OR, boolean_expression))": 147,
      "boolean_expression(between_expression, OR, boolean_expression(binary_expression, OR, boolean_expression))": 148,
      "boolean_expression(binary_expression(identifier, range_operator, binary_expression), AND, binary_expression(identifier, range_operator, number))": 149,
      "binary_expression(binary_expression(binary_expression, arithmetic_operator, number), range_operator, number)": 150,
      "boolean_expression(binary_expression(identifier, range_operator, number), AND, boolean_expression(boolean_expression, AND, is_expression))": 151,
      "boolean_expression(binary_expression(identifier, range_operator, number), AND, boolean_expression(NOT, is_expression))": 152,
      "where_clause(WHERE, boolean_expression(boolean_expression, OR, is_expression))": 153,
      "boolean_expression(binary_expression(identifier, range_operator, number), AND, boolean_expression(binary_expression, AND, is_expression))": 154,
      "boolean_expression(binary_expression(identifier, LIKE, string), AND, binary_expression(identifier, range_operator, number))": 155,
      "boolean_expression(binary_expression(identifier, =, identifier), AND, boolean_expression(boolean_expression, OR, is_expression))": 156,
      "boolean_expression(binary_expression(identifier, range_operator, number), OR, boolean_expression(boolean_expression, OR, in_expression))": 157,
      "boolean_expression(binary_expression(identifier, =, number), AND, boolean_expression(binary_expression, AND, binary_expression))": 158,
      "boolean_expression(binary_expression(identifier, !=, number), AND, boolean_expression(binary_expression, AND, binary_expression))": 159,
      "boolean_expression(binary_expression(identifier, =, identifier), AND, binary_expression(identifier, =, number))": 160,
      "boolean_expression(boolean_expression(binary_expression, AND, boolean_expression), AND, exists_expression)": 161,
      "boolean_expression(boolean_expression(NOT, exists_expression), AND, boolean_expression(binary_expression, AND, boolean_expression))": 162,
      "select_statement(select_clause, from_clause, where_clause, group_by_clause, limit_clause)": 163,
      "boolean_expression(between_expression, AND, boolean_expression(binary_expression, AND, boolean_expression))": 164,
      "select_statement(select_clause, from_clause, where_clause, group_by_clause, order_by_clause)": 165,
      "boolean_expression(boolean_expression(NOT, is_expression), OR, boolean_expression(binary_expression, OR, boolean_expression))": 166,
      "boolean_expression(binary_expression(identifier, !=, number), AND, binary_expression(identifier, =, identifier))": 167,
      "boolean_expression(binary_expression(identifier, range_operator, number), AND, boolean_expression(NOT, in_expression))": 168,
      "where_clause(WHERE, boolean_expression(boolean_expression, OR, in_expression))": 169,
      "boolean_expression(binary_expression(identifier, range_operator, number), AND, boolean_expression(binary_expression, AND, in_expression))": 170,
      "with_clause(cte(identifier, AS, select_statement(select_clause, from_clause, where_clause, order_by_clause, limit_clause)))": 171,
      "boolean_expression(binary_expression(identifier, range_operator, number), AND, boolean_expression(boolean_expression, AND, in_expression))": 172,
      "boolean_expression(boolean_expression(NOT, is_expression), AND, boolean_expression(binary_expression, AND, boolean_expression))": 173,
      "boolean_expression(boolean_expression(binary_expression, AND, binary_expression), AND, is_expression)": 174,
      "boolean_expression(binary_expression(identifier, =, identifier), AND, boolean_expression(boolean_expression, OR, in_expression))": 175,
      "boolean_expression(between_expression, OR, binary_expression(identifier, range_operator, number))": 176,
      "boolean_expression(binary_expression(identifier, =, identifier), AND, boolean_expression(binary_expression, AND, is_expression))": 177,
      "where_clause(WHERE, boolean_expression(between_expression, AND, binary_expression))": 178,
      "boolean_expression(binary_expression(identifier, =, string), OR, binary_expression(identifier, range_operator, number))": 179,
      "boolean_expression(binary_expression(identifier, !=, string), OR, binary_expression(identifier, range_operator, number))": 180,
      "where_clause(WHERE, binary_expression(identifier, range_operator, binary_expression))": 181,
      "boolean_expression(boolean_expression(NOT, in_expression), OR, boolean_expression(binary_expression, OR, boolean_expression))": 182,
      "boolean_expression(boolean_expression(binary_expression, AND, binary_expression), AND, in_expression)": 183,
      "boolean_expression(binary_expression(identifier, =, identifier), AND, boolean_expression(binary_expression, AND, in_expression))": 184,
      "boolean_expression(boolean_expression(NOT, in_expression), AND, boolean_expression(binary_expression, AND, boolean_expression))": 185,
      "boolean_expression(binary_expression(binary_expression, range_operator, number), AND, binary_expression(identifier, range_operator, number))": 186,
      "binary_expression(identifier, range_operator, select_subexpression)": 187,
      "binary_expression(binary_expression(binary_expression, arithmetic_operator, identifier), arithmetic_operator, identifier)": 188,
      "join_clause(join_clause, JOIN, select_subexpression, join_condition(ON, binary_expression(identifier, =, identifier)))": 189,
      "boolean_expression(boolean_expression(binary_expression, AND, binary_expression), OR, boolean_expression(boolean_expression, OR, boolean_expression))": 190,
      "select_clause_body(binary_expression(binary_expression, arithmetic_operator, identifier))": 191,
      "binary_expression(binary_expression(binary_expression, arithmetic_operator, identifier), arithmetic_operator, number)": 192,
      "select_clause_body(binary_expression(identifier, arithmetic_operator, identifier))": 193,
      "having_clause(HAVING, binary_expression(identifier, range_operator, number))": 194,
      "boolean_expression(binary_expression(identifier, =, number), OR, boolean_expression(binary_expression, OR, binary_expression))": 195,
      "binary_expression(binary_expression(binary_expression, arithmetic_operator, number), arithmetic_operator, identifier)": 196,
      "boolean_expression(binary_expression(identifier, range_operator, binary_expression), OR, binary_expression(identifier, range_operator, number))": 197,
      "boolean_expression(between_expression, AND, binary_expression(identifier, =, identifier))": 198,
      "where_clause(WHERE, binary_expression(identifier, =, string))": 199,
      "where_clause(WHERE, boolean_expression(binary_expression, OR, is_expression))": 200,
      "boolean_expression(in_expression, AND, is_expression)": 201,
      "conditional_expression(CASE, identifier, WHEN, number, THEN, identifier, ELSE, number, END)": 202,
      "conditional_expression(CASE, identifier, WHEN, number, THEN, identifier, ELSE, NULL, END)": 203,
      "where_clause(WHERE, boolean_expression(binary_expression, AND, exists_expression))": 204,
      "boolean_expression(binary_expression(identifier, LIKE, string), OR, boolean_expression(binary_expression, OR, boolean_expression))": 205,
      "where_clause(WHERE, binary_expression(identifier, !=, string))": 206,
      "boolean_expression(binary_expression(identifier, !=, number), OR, boolean_expression(binary_expression, OR, binary_expression))": 207,
      "boolean_expression(boolean_expression(binary_expression, AND, boolean_expression), OR, boolean_expression(boolean_expression, OR, boolean_expression))": 208,
      "conditional_expression(CASE, identifier, WHEN, number, THEN, identifier, ELSE, identifier, END)": 209,
      "boolean_expression(binary_expression(identifier, range_operator, number), OR, boolean_expression(NOT, is_expression))": 210,
      "boolean_expression(boolean_expression(binary_expression, AND, binary_expression), OR, boolean_expression(binary_expression, AND, boolean_expression))": 211,
      "where_clause(WHERE, boolean_expression(binary_expression, OR, in_expression))": 212,
      "join_clause(identifier, JOIN, select_subexpression, join_condition(ON, binary_expression(identifier, =, identifier)))": 213,
      "boolean_expression(binary_expression(identifier, !=, number), AND, binary_expression(identifier, =, number))": 214,
      "boolean_expression(binary_expression(identifier, range_operator, number), OR, boolean_expression(between_expression, OR, boolean_expression))": 215,
      "boolean_expression(binary_expression(identifier, LIKE, string), AND, boolean_expression(binary_expression, AND, boolean_expression))": 216,
      "boolean_expression(binary_expression(identifier, =, number), AND, is_expression)": 217,
      "where_clause(WHERE, boolean_expression(NOT, is_expression))": 218,
      "where_clause(WHERE, boolean_expression(NOT, in_expression))": 219,
      "boolean_expression(binary_expression(identifier, !=, number), AND, is_expression)": 220,
      "select_statement(select_clause, from_clause, where_clause, group_by_clause, order_by_clause, limit_clause)": 221,
      "boolean_expression(binary_expression(identifier, range_operator, number), OR, boolean_expression(NOT, in_expression))": 222,
      "boolean_expression(binary_expression(identifier, range_operator, number), OR, boolean_expression(binary_expression, OR, is_expression))": 223,
      "boolean_expression(boolean_expression(boolean_expression, OR, boolean_expression), OR, is_expression)": 224,
      "boolean_expression(binary_expression(identifier, !=, number), AND, in_expression)": 225,
      "boolean_expression(binary_expression(identifier, =, identifier), AND, boolean_expression(boolean_expression, AND, boolean_expression))": 226,
      "boolean_expression(binary_expression(identifier, range_operator, number), AND, boolean_expression(NOT, between_expression))": 227,
      "boolean_expression(binary_expression(identifier, range_operator, number), AND, boolean_expression(between_expression, AND, boolean_expression))": 228,
      "boolean_expression(binary_expression(identifier, =, number), AND, in_expression)": 229,
      "boolean_expression(binary_expression(identifier, range_operator, number), OR, boolean_expression(binary_expression, OR, in_expression))": 230,
      "binary_expression(binary_expression(identifier, arithmetic_operator, number), arithmetic_operator, number)": 231,
      "select_clause_body(binary_expression(binary_expression, arithmetic_operator, number))": 232,
      "where_clause(WHERE, boolean_expression(between_expression, OR, boolean_expression))": 233,
      "boolean_expression(binary_expression(identifier, range_operator, number), AND, boolean_expression(between_expression, AND, binary_expression))": 234,
      "where_clause(WHERE, binary_expression(identifier, LIKE, string))": 235,
      "boolean_expression(binary_expression(identifier, =, string), AND, boolean_expression(binary_expression, AND, binary_expression))": 236,
      "where_clause(WHERE, boolean_expression(boolean_expression, AND, is_expression))": 237,
      "boolean_expression(binary_expression(identifier, =, number), OR, boolean_expression(boolean_expression, OR, boolean_expression))": 238,
      "boolean_expression(binary_expression(identifier, =, identifier), AND, boolean_expression(between_expression, OR, boolean_expression))": 239,
      "boolean_expression(binary_expression(identifier, =, identifier), AND, boolean_expression(binary_expression, OR, is_expression))": 240,
      "boolean_expression(binary_expression(identifier, !=, number), OR, boolean_expression(boolean_expression, OR, boolean_expression))": 241,
      "boolean_expression(binary_expression(identifier, range_operator, binary_expression), OR, boolean_expression(binary_expression, OR, boolean_expression))": 242,
      "group_by_clause(group_expression(rollup_clause))": 243,
      "boolean_expression(boolean_expression(binary_expression, OR, binary_expression), OR, is_expression)": 244,
      "boolean_expression(binary_expression(binary_expression, range_operator, number), OR, boolean_expression(binary_expression, OR, boolean_expression))": 245,
      "boolean_expression(between_expression, AND, boolean_expression(binary_expression, AND, binary_expression))": 246,
      "boolean_expression(binary_expression(identifier, !=, string), AND, boolean_expression(binary_expression, AND, binary_expression))": 247,
      "binary_expression(binary_expression(binary_expression, arithmetic_operator, identifier), =, number)": 248,
      "boolean_expression(boolean_expression(binary_expression, OR, binary_expression), OR, in_expression)": 249,
      "where_clause(WHERE, boolean_expression(boolean_expression, AND, in_expression))": 250,
      "boolean_expression(binary_expression(identifier, =, identifier), AND, boolean_expression(boolean_expression, AND, is_expression))": 251,
      "binary_expression(binary_expression(binary_expression, arithmetic_operator, identifier), !=, number)": 252,
      "boolean_expression(binary_expression(identifier, LIKE, string), OR, binary_expression(identifier, range_operator, number))": 253,
      "boolean_expression(boolean_expression(NOT, between_expression), OR, boolean_expression(binary_expression, OR, boolean_expression))": 254,
      "boolean_expression(boolean_expression(boolean_expression, OR, boolean_expression), OR, in_expression)": 255,
      "conditional_expression(CASE, WHEN, binary_expression(identifier, range_operator, number), THEN, identifier, END)": 256,
      "boolean_expression(binary_expression(identifier, =, identifier), AND, boolean_expression(between_expression, AND, binary_expression))": 257,
      "select_subexpression(select_statement(select_clause, from_clause, where_clause, group_by_clause))": 258,
      "boolean_expression(binary_expression(identifier, !=, string), AND, binary_expression(identifier, =, identifier))": 259,
      "boolean_expression(boolean_expression(NOT, between_expression), AND, boolean_expression(binary_expression, AND, boolean_expression))": 260,
      "binary_expression(number, arithmetic_operator, number)": 261,
      "boolean_expression(binary_expression(identifier, =, identifier), AND, binary_expression(identifier, =, string))": 262,
      "function_call(COUNT, number)": 263,
      "boolean_expression(binary_expression(binary_expression, range_operator, number), AND, boolean_expression(binary_expression, AND, boolean_expression))": 264,
      "binary_expression(binary_expression(identifier, arithmetic_operator, identifier), !=, number)": 265,
      "boolean_expression(binary_expression(identifier, =, identifier), AND, boolean_expression(binary_expression, OR, in_expression))": 266,
      "function_call(SUM, number)": 267,
      "boolean_expression(binary_expression(identifier, range_operator, binary_expression), AND, boolean_expression(binary_expression, AND, boolean_expression))": 268,
      "function_call(MIN, number)": 269,
      "function_call(AVG, number)": 270,
      "function_call(MAX, number)": 271,
      "boolean_expression(is_expression, AND, is_expression)": 272,
      "boolean_expression(binary_expression(identifier, =, identifier), AND, boolean_expression(boolean_expression, AND, in_expression))": 273,
      "binary_expression(function_call(COUNT), range_operator, number)": 274,
      "binary_expression(binary_expression(identifier, arithmetic_operator, identifier), =, number)": 275,
      "boolean_expression(binary_expression(binary_expression, range_operator, number), OR, binary_expression(identifier, range_operator, number))": 276,
      "boolean_expression(binary_expression(identifier, =, identifier), AND, binary_expression(identifier, LIKE, string))": 277,
      "binary_expression(binary_expression(binary_expression, arithmetic_operator, binary_expression), range_operator, number)": 278,
      "having_clause(HAVING, boolean_expression(binary_expression, AND, binary_expression))": 279,
      "boolean_expression(boolean_expression(binary_expression, AND, binary_expression), OR, boolean_expression(binary_expression, OR, binary_expression))": 280,
      "boolean_expression(boolean_expression(binary_expression, AND, binary_expression), OR, boolean_expression(binary_expression, AND, binary_expression))": 281,
      "boolean_expression(between_expression, AND, is_expression)": 282,
      "boolean_expression(binary_expression(identifier, range_operator, number), OR, boolean_expression(binary_expression, AND, is_expression))": 283,
      "where_clause(WHERE, boolean_expression(NOT, between_expression))": 284,
      "where_clause(WHERE, boolean_expression(between_expression, OR, binary_expression))": 285,
      "boolean_expression(binary_expression(identifier, range_operator, number), AND, boolean_expression(NOT, exists_expression))": 286,
      "rollup_clause(ROLLUP, identifier, identifier)": 287,
      "boolean_expression(binary_expression(identifier, range_operator, number), AND, exists_expression)": 288,
      "binary_expression(identifier, =, select_subexpression)": 289,
      "boolean_expression(binary_expression(identifier, !=, number), OR, binary_expression(identifier, =, number))": 290,
      "binary_expression(binary_expression(identifier, arithmetic_operator, identifier), arithmetic_operator, binary_expression(identifier, arithmetic_operator, number))": 291,
      "boolean_expression(boolean_expression(NOT, is_expression), AND, boolean_expression(binary_expression, AND, binary_expression))": 292,
      "boolean_expression(boolean_expression(binary_expression, AND, binary_expression), OR, is_expression)": 293,
      "boolean_expression(binary_expression(identifier, range_operator, number), OR, boolean_expression(binary_expression, AND, in_expression))": 294,
      "boolean_expression(between_expression, AND, in_expression)": 295,
      "boolean_expression(binary_expression(identifier, !=, string), OR, boolean_expression(boolean_expression, OR, boolean_expression))": 296,
      "boolean_expression(binary_expression(identifier, range_operator, number), OR, boolean_expression(NOT, between_expression))": 297,
      "boolean_expression(binary_expression(identifier, range_operator, number), OR, boolean_expression(between_expression, OR, binary_expression))": 298,
      "boolean_expression(binary_expression(identifier, =, string), OR, boolean_expression(boolean_expression, OR, boolean_expression))": 299,
      "boolean_expression(binary_expression(identifier, =, number), AND, binary_expression(identifier, =, number))": 300,
      "boolean_expression(binary_expression(identifier, =, string), AND, is_expression)": 301,
      "boolean_expression(boolean_expression(NOT, in_expression), AND, boolean_expression(binary_expression, AND, binary_expression))": 302,
      "boolean_expression(boolean_expression(binary_expression, AND, is_expression), OR, boolean_expression(binary_expression, OR, boolean_expression))": 303,
      "boolean_expression(binary_expression(identifier, =, string), OR, boolean_expression(binary_expression, OR, binary_expression))": 304,
      "boolean_expression(binary_expression(identifier, !=, number), AND, binary_expression(identifier, !=, number))": 305,
      "boolean_expression(boolean_expression(binary_expression, AND, boolean_expression), OR, is_expression)": 306,
      "boolean_expression(binary_expression(identifier, !=, number), OR, boolean_expression(binary_expression, AND, binary_expression))": 307,
      "boolean_expression(binary_expression(identifier, range_operator, number), AND, boolean_expression(NOT, binary_expression))": 308,
      "boolean_expression(binary_expression(identifier, =, number), OR, is_expression)": 309,
      "boolean_expression(boolean_expression(binary_expression, AND, boolean_expression), OR, boolean_expression(binary_expression, OR, binary_expression))": 310,
      "boolean_expression(boolean_expression(binary_expression, AND, binary_expression), OR, in_expression)": 311,
      "boolean_expression(boolean_expression(NOT, binary_expression), AND, boolean_expression(binary_expression, AND, boolean_expression))": 312,
      "boolean_expression(in_expression, AND, in_expression)": 313,
      "boolean_expression(between_expression, AND, binary_expression(identifier, !=, number))": 314,
      "boolean_expression(between_expression, AND, binary_expression(identifier, =, number))": 315,
      "select_subexpression(select_statement(select_clause, from_clause, where_clause, group_by_clause, limit_clause))": 316,
      "boolean_expression(binary_expression(identifier, =, number), OR, boolean_expression(binary_expression, AND, binary_expression))": 317,
      "boolean_expression(binary_expression(identifier, !=, string), AND, is_expression)": 318,
      "boolean_expression(binary_expression(identifier, !=, string), OR, boolean_expression(binary_expression, OR, binary_expression))": 319,
      "boolean_expression(binary_expression(identifier, !=, number), OR, is_expression)": 320,
      "select_subexpression(select_statement(select_clause, from_clause, where_clause, group_by_clause, order_by_clause))": 321,
      "boolean_expression(between_expression, OR, boolean_expression(boolean_expression, OR, boolean_expression))": 322,
      "boolean_expression(binary_expression(identifier, LIKE, string), AND, boolean_expression(binary_expression, AND, binary_expression))": 323,
      "where_clause(WHERE, boolean_expression(between_expression, AND, boolean_expression))": 324,
      "boolean_expression(boolean_expression(binary_expression, OR, boolean_expression), AND, exists_expression)": 325,
      "boolean_expression(boolean_expression(NOT, binary_expression), OR, boolean_expression(binary_expression, OR, boolean_expression))": 326,
      "boolean_expression(binary_expression(identifier, =, number), OR, in_expression)": 327,
      "boolean_expression(binary_expression(identifier, !=, number), AND, binary_expression(identifier, =, string))": 328,
      "boolean_expression(binary_expression(identifier, !=, number), OR, in_expression)": 329,
      "boolean_expression(in_expression, OR, is_expression)": 330,
      "function_call(SUM, string)": 331,
      "boolean_expression(binary_expression(identifier, =, string), AND, in_expression)": 332,
      "binary_expression(binary_expression(identifier, arithmetic_operator, identifier), arithmetic_operator, identifier)": 333,
      "boolean_expression(between_expression, OR, boolean_expression(binary_expression, OR, binary_expression))": 334,
      "boolean_expression(boolean_expression(NOT, is_expression), OR, boolean_expression(binary_expression, OR, binary_expression))": 335,
      "boolean_expression(binary_expression(identifier, =, number), AND, binary_expression(identifier, =, string))": 336,
      "boolean_expression(binary_expression(identifier, !=, string), AND, binary_expression(identifier, =, number))": 337,
      "boolean_expression(binary_expression(identifier, !=, string), AND, in_expression)": 338,
      "boolean_expression(boolean_expression(NOT, exists_expression), AND, boolean_expression(binary_expression, OR, boolean_expression))": 339,
      "binary_expression(binary_expression(identifier, arithmetic_operator, number), arithmetic_operator, binary_expression(identifier, arithmetic_operator, number))": 340,
      "boolean_expression(binary_expression(identifier, =, number), OR, boolean_expression(binary_expression, AND, boolean_expression))": 341,
      "boolean_expression(boolean_expression(binary_expression, AND, boolean_expression), OR, in_expression)": 342,
      "boolean_expression(binary_expression(identifier, =, identifier), AND, boolean_expression(between_expression, OR, binary_expression))": 343,
      "function_call(COUNT, string)": 344,
      "boolean_expression(binary_expression(identifier, =, binary_expression), AND, binary_expression(identifier, range_operator, number))": 345,
      "boolean_expression(boolean_expression(binary_expression, AND, boolean_expression), OR, boolean_expression(binary_expression, AND, boolean_expression))": 346,
      "function_call(MIN, conditional_expression)": 347,
      "boolean_expression(boolean_expression(binary_expression, AND, in_expression), OR, boolean_expression(binary_expression, OR, boolean_expression))": 348,
      "function_call(COUNT, conditional_expression)": 349,
      "boolean_expression(binary_expression(identifier, !=, number), AND, binary_expression(identifier, !=, string))": 350,
      "function_call(MAX, string)": 351,
      "boolean_expression(binary_expression(identifier, =, identifier), AND, boolean_expression(between_expression, AND, boolean_expression))": 352,
      "binary_expression(binary_expression(binary_expression, arithmetic_operator, number), =, number)": 353,
      "function_call(SUM, conditional_expression)": 354,
      "binary_expression(binary_expression(number, arithmetic_operator, number), arithmetic_operator, identifier)": 355,
      "function_call(AVG, conditional_expression)": 356,
      "function_call(MIN, string)": 357,
      "function_call(AVG, string)": 358,
      "conditional_expression(CASE, WHEN, binary_expression(identifier, range_operator, number), THEN, identifier, ELSE, number, END)": 359,
      "boolean_expression(binary_expression(identifier, !=, number), OR, boolean_expression(binary_expression, AND, boolean_expression))": 360,
      "boolean_expression(binary_expression(identifier, !=, binary_expression), AND, binary_expression(identifier, range_operator, number))": 361,
      "function_call(MAX, conditional_expression)": 362,
      "binary_expression(binary_expression(binary_expression, arithmetic_operator, number), !=, number)": 363,
      "conditional_expression(CASE, WHEN, binary_expression(identifier, range_operator, number), THEN, identifier, ELSE, NULL, END)": 364,
      "conditional_expression(CASE, WHEN, binary_expression(identifier, range_operator, number), THEN, identifier, ELSE, identifier, END)": 365,
      "binary_expression(binary_expression(binary_expression, arithmetic_operator, number), arithmetic_operator, number)": 366,
      "boolean_expression(boolean_expression(NOT, in_expression), OR, boolean_expression(binary_expression, OR, binary_expression))": 367,
      "boolean_expression(boolean_expression(boolean_expression, OR, is_expression), OR, is_expression)": 368,
      "boolean_expression(binary_expression(identifier, range_operator, binary_expression), AND, boolean_expression(binary_expression, AND, binary_expression))": 369,
      "boolean_expression(binary_expression(identifier, LIKE, string), AND, is_expression)": 370,
      "where_clause(WHERE, binary_expression(identifier, range_operator, select_subexpression))": 371,
      "boolean_expression(boolean_expression(boolean_expression, AND, boolean_expression), AND, is_expression)": 372,
      "boolean_expression(binary_expression(identifier, !=, number), AND, boolean_expression(boolean_expression, AND, boolean_expression))": 373,
      "boolean_expression(binary_expression(identifier, !=, number), AND, binary_expression(identifier, range_operator, binary_expression))": 374,
      "boolean_expression(binary_expression(binary_expression, range_operator, number), AND, binary_expression(identifier, =, identifier))": 375,
      "boolean_expression(binary_expression(identifier, =, number), AND, boolean_expression(boolean_expression, AND, boolean_expression))": 376,
      "boolean_expression(binary_expression(identifier, LIKE, string), AND, in_expression)": 377,
      "boolean_expression(boolean_expression(binary_expression, AND, binary_expression), AND, exists_expression)": 378,
      "boolean_expression(boolean_expression(boolean_expression, AND, is_expression), AND, is_expression)": 379,
      "where_clause(WHERE, binary_expression(binary_expression, range_operator, number))": 380,
      "with_clause(cte(identifier, AS, select_statement(select_clause, from_clause, where_clause, group_by_clause)))": 381,
      "boolean_expression(binary_expression(binary_expression, range_operator, number), AND, boolean_expression(binary_expression, AND, binary_expression))": 382,
      "where_clause(WHERE, binary_expression(identifier, !=, binary_expression))": 383,
      "boolean_expression(binary_expression(identifier, =, number), OR, boolean_expression(boolean_expression, OR, is_expression))": 384,
      "where_clause(WHERE, binary_expression(identifier, =, binary_expression))": 385,
      "boolean_expression(binary_expression(identifier, =, identifier), AND, binary_expression(identifier, range_operator, binary_expression))": 386,
      "boolean_expression(boolean_expression(NOT, exists_expression), AND, boolean_expression(binary_expression, AND, binary_expression))": 387,
      "boolean_expression(boolean_expression(binary_expression, AND, is_expression), AND, is_expression)": 388,
      "boolean_expression(binary_expression(identifier, =, number), AND, binary_expression(identifier, range_operator, binary_expression))": 389,
      "binary_expression(identifier, !=, select_subexpression)": 390,
      "boolean_expression(boolean_expression(NOT, between_expression), AND, boolean_expression(binary_expression, AND, binary_expression))": 391,
      "boolean_expression(binary_expression(identifier, range_operator, number), OR, boolean_expression(between_expression, AND, binary_expression))": 392,
      "boolean_expression(binary_expression(identifier, !=, number), OR, boolean_expression(boolean_expression, OR, is_expression))": 393,
      "select_statement(with_clause, select_clause, from_clause, where_clause, group_by_clause)": 394,
      "boolean_expression(boolean_expression(binary_expression, AND, binary_expression), OR, boolean_expression(binary_expression, AND, is_expression))": 395,
      "boolean_expression(binary_expression(identifier, =, number), OR, binary_expression(identifier, =, number))": 396,
      "select_subexpression(select_statement(select_clause, from_clause, where_clause, group_by_clause, order_by_clause, limit_clause))": 397,
      "boolean_expression(binary_expression(identifier, =, number), AND, boolean_expression(NOT, is_expression))": 398,
      "boolean_expression(between_expression, OR, boolean_expression(binary_expression, AND, binary_expression))": 399,
      "boolean_expression(binary_expression(identifier, !=, number), AND, boolean_expression(binary_expression, AND, is_expression))": 400,
      "boolean_expression(binary_expression(identifier, LIKE, string), OR, boolean_expression(boolean_expression, OR, boolean_expression))": 401,
      "boolean_expression(binary_expression(identifier, !=, number), AND, boolean_expression(NOT, is_expression))": 402,
      "boolean_expression(binary_expression(binary_expression, !=, number), AND, binary_expression(identifier, range_operator, number))": 403,
      "function_call(SUM, time)": 404,
      "boolean_expression(boolean_expression(boolean_expression, OR, in_expression), OR, is_expression)": 405,
      "boolean_expression(binary_expression(identifier, =, number), AND, boolean_expression(binary_expression, AND, is_expression))": 406,
      "boolean_expression(boolean_expression(boolean_expression, AND, boolean_expression), AND, in_expression)": 407,
      "boolean_expression(boolean_expression(boolean_expression, OR, is_expression), OR, in_expression)": 408,
      "boolean_expression(binary_expression(identifier, !=, number), OR, boolean_expression(boolean_expression, OR, in_expression))": 409,
      "boolean_expression(binary_expression(identifier, !=, number), AND, boolean_expression(boolean_expression, AND, is_expression))": 410,
      "boolean_expression(boolean_expression(binary_expression, AND, binary_expression), OR, boolean_expression(binary_expression, AND, in_expression))": 411,
      "boolean_expression(binary_expression(identifier, range_operator, number), OR, boolean_expression(NOT, binary_expression))": 412,
      "boolean_expression(binary_expression(binary_expression, =, number), AND, binary_expression(identifier, range_operator, number))": 413,
      "function_call(COUNT, time)": 414,
      "boolean_expression(is_expression, OR, is_expression)": 415,
      "boolean_expression(boolean_expression(binary_expression, AND, is_expression), AND, in_expression)": 416,
      "boolean_expression(binary_expression(identifier, =, number), AND, boolean_expression(boolean_expression, AND, is_expression))": 417,
      "boolean_expression(binary_expression(identifier, !=, number), OR, binary_expression(identifier, !=, number))": 418,
      "boolean_expression(binary_expression(identifier, =, number), OR, boolean_expression(boolean_expression, OR, in_expression))": 419,
      "boolean_expression(boolean_expression(NOT, is_expression), OR, boolean_expression(boolean_expression, OR, boolean_expression))": 420,
      "boolean_expression(binary_expression(identifier, =, number), AND, binary_expression(identifier, LIKE, string))": 421,
      "boolean_expression(binary_expression(identifier, !=, number), AND, binary_expression(identifier, LIKE, string))": 422,
      "boolean_expression(between_expression, OR, is_expression)": 423,
      "boolean_expression(boolean_expression(binary_expression, AND, is_expression), OR, boolean_expression(boolean_expression, OR, boolean_expression))": 424,
      "boolean_expression(binary_expression(identifier, =, binary_expression), OR, binary_expression(identifier, range_operator, number))": 425,
      "function_call(MAX, time)": 426,
      "function_call(AVG, time)": 427,
      "boolean_expression(boolean_expression(binary_expression, AND, in_expression), AND, is_expression)": 428,
      "having_clause(HAVING, binary_expression(identifier, =, number))": 429,
      "boolean_expression(binary_expression(identifier, range_operator, binary_expression), AND, is_expression)": 430,
      "boolean_expression(binary_expression(identifier, !=, number), AND, boolean_expression(NOT, in_expression))": 431,
      "boolean_expression(binary_expression(identifier, !=, string), AND, binary_expression(identifier, =, string))": 432,
      "having_clause(HAVING, binary_expression(function_call, range_operator, number))": 433,
      "boolean_expression(between_expression, OR, binary_expression(identifier, =, number))": 434,
      "boolean_expression(binary_expression(identifier, !=, number), AND, boolean_expression(binary_expression, AND, in_expression))": 435,
      "boolean_expression(binary_expression(identifier, !=, binary_expression), OR, binary_expression(identifier, range_operator, number))": 436,
      "function_call(MIN, time)": 437,
      "having_clause(HAVING, binary_expression(identifier, range_operator, function_call))": 438,
      "boolean_expression(binary_expression(identifier, =, number), AND, boolean_expression(NOT, in_expression))": 439,
      "boolean_expression(between_expression, OR, binary_expression(identifier, !=, number))": 440,
      "boolean_expression(between_expression, AND, binary_expression(identifier, !=, string))": 441,
