{
  "version": "1.0",
  "truncation": null,
  "padding": null,
  "added_tokens": [
    {
      "id": 0,
      "content": "<pad>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 1,
      "content": "<sos>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 2,
      "content": "<eos>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 3,
      "content": "<unk>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 4,
      "content": "<tb>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 5,
      "content": "</tb>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 6,
      "content": "<col>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    }
  ],
  "normalizer": null,
  "pre_tokenizer": null,
  "post_processor": null,
  "decoder": null,
  "model": {
    "type": "WordLevel",
    "vocab": {
      "<pad>": 0,
      "<sos>": 1,
      "<eos>": 2,
      "<unk>": 3,
      "<tb>": 4,
      "</tb>": 5,
      "<col>": 6,
      "!!": 7,
      "!=": 8,
      "!~": 9,
      "!~*": 10,
      "\"": 11,
      "#": 12,
      "#>": 13,
      "#>>": 14,
      "$": 15,
      "%": 16,
      "&": 17,
      "&&": 18,
      "'": 19,
      "(": 20,
      ")": 21,
      "*": 22,
      "+": 23,
      ",": 24,
      "-": 25,
      "->": 26,
      "->>": 27,
      ".": 28,
      ".*": 29,
      "/": 30,
      ":": 31,
      "::": 32,
      ";": 33,
      "<": 34,
      "<<": 35,
      "<=": 36,
      "<>": 37,
      "=": 38,
      ">": 39,
      ">=": 40,
      ">>": 41,
      "@": 42,
      "ADD": 43,
      "AFTER": 44,
      "ALL": 45,
      "ALTER": 46,
      "ALTER_COLUMN": 47,
      "AND": 48,
      "AS": 49,
      "ASC": 50,
      "AT": 51,
      "ATOMIC": 52,
      "AT_TIME_ZONE": 53,
      "AUTO_INCREMENT": 54,
      "BEFORE": 55,
      "BEGIN": 56,
      "BETWEEN": 57,
      "BY": 58,
      "CACHE": 59,
      "CALLED_ON_NULL_INPUT": 60,
      "CASCADE": 61,
      "CASCADED": 62,
      "CASE": 63,
      "CHECK": 64,
      "CHECK_OPTION": 65,
      "COLUMN": 66,
      "COMMENT_ON": 67,
      "COMMIT": 68,
      "CONCURRENTLY": 69,
      "CONSTRAINT": 70,
      "CONTAINS_SQL": 71,
      "COST": 72,
      "CREATE": 73,
      "CREATE_DOMAIN": 74,
      "CREATE_EXTENSION": 75,
      "CREATE_MATERIALIZED_VIEW": 76,
      "CREATE_OR_REPLACE_FUNCTION": 77,
      "CREATE_OR_REPLACE_PROCEDURE": 78,
      "CREATE_ROLE": 79,
      "CREATE_SCHEMA": 80,
      "CREATE_TYPE": 81,
      "CUBE": 82,
      "CURRENT_ROLE": 83,
      "CURRENT_ROW": 84,
      "CURRENT_USER": 85,
      "DATA": 86,
      "DATABASE": 87,
      "DATE": 88,
      "DATETIME": 89,
      "DECLARE": 90,
      "DEFAULT": 91,
      "DEFERRABLE": 92,
      "DEFERRED": 93,
      "DEFINER": 94,
      "DELETE": 95,
      "DESC": 96,
      "DETERMINISTIC": 97,
      "DISTINCT": 98,
      "DISTINCT_FROM": 99,
      "DROP": 100,
      "EACH": 101,
      "ELSE": 102,
      "END": 103,
      "ENUM": 104,
      "EXCEPT": 105,
      "EXCLUDE": 106,
      "EXCLUDE_CURRENT_ROW": 107,
      "EXCLUDE_GROUP": 108,
      "EXCLUDE_NO_OTHERS": 109,
      "EXCLUDE_TIES": 110,
      "EXECUTE": 111,
      "EXISTS": 112,
      "EXTENSION": 113,
      "EXTERNAL": 114,
      "FALSE": 115,
      "FETCH": 116,
      "FILTER": 117,
      "FIRST": 118,
      "FOLLOWING": 119,
      "FOLLOWS": 120,
      "FOR": 121,
      "FOREIGN_KEY": 122,
      "FROM": 123,
      "FULL": 124,
      "FUNCTION": 125,
      "GRANT": 126,
      "GROUP": 127,
      "GROUPING_SETS": 128,
      "GROUPS": 129,
      "GROUP_BY": 130,
      "HAVING": 131,
      "IF": 132,
      "IF_EXISTS": 133,
      "IF_NOT_EXISTS": 134,
      "IMMEDIATE": 135,
      "IMMUTABLE": 136,
      "IN": 137,
      "INCLUDE": 138,
      "INCREMENT": 139,
      "INDEX": 140,
      "INITIALLY": 141,
      "INNER": 142,
      "INOUT": 143,
      "INSERT": 144,
      "INSTEAD_OF": 145,
      "INTERSECT": 146,
      "INTO": 147,
      "INVOKER": 148,
      "IS": 149,
      "JOIN": 150,
      "LANGUAGE": 151,
      "LAST": 152,
      "LATERAL": 153,
      "LEAKPROOF": 154,
      "LEFT": 155,
      "LIKE": 156,
      "LIMIT": 157,
      "LOCAL": 158,
      "MATERIALIZED": 159,
      "MATERIALIZED_VIEW": 160,
      "MAXVALUE": 161,
      "MINVALUE": 162,
      "MODIFIES_SQL_DATA": 163,
      "NATURAL": 164,
      "NEW": 165,
      "NEXT": 166,
      "NO": 167,
      "NOT": 168,
      "NOT_DEFERRABLE": 169,
      "NOT_LIKE": 170,
      "NO_SQL": 171,
      "NULL": 172,
      "NULLS": 173,
      "OF": 174,
      "OFFSET": 175,
      "OLD": 176,
      "ON": 177,
      "ONLY": 178,
      "ON_DELETE": 179,
      "ON_UPDATE": 180,
      "OR": 181,
      "ORDER_BY": 182,
      "OR_REPLACE": 183,
      "OUT": 184,
      "OUTER": 185,
      "OVER": 186,
      "OWNED_BY": 187,
      "OWNER_TO": 188,
      "PARALLEL": 189,
      "PARTITION_BY": 190,
      "PRECEDES": 191,
      "PRECEDING": 192,
      "PRECISION": 193,
      "PRIMARY_KEY": 194,
      "PRIVILEGES": 195,
      "PROCEDURE": 196,
      "PUBLIC": 197,
      "RANGE": 198,
      "READS_SQL_DATA": 199,
      "RECURSIVE": 200,
      "REFERENCES": 201,
      "REFERENCING": 202,
      "RENAME": 203,
      "RENAME_TO": 204,
      "REPEATABLE": 205,
      "RESTRICT": 206,
      "RESTRICTED": 207,
      "RETURN": 208,
      "RETURNS": 209,
      "RETURNS_NULL_ON_NULL_INPUT": 210,
      "RIGHT": 211,
      "ROLLBACK": 212,
      "ROLLUP": 213,
      "ROW": 214,
      "ROWS": 215,
      "SAFE": 216,
      "SCHEMA": 217,
      "SECURITY_DEFINER": 218,
      "SECURITY_INVOKER": 219,
      "SELECT": 220,
      "SEQUENCE": 221,
      "SESSION": 222,
      "SESSION_USER": 223,
      "SET": 224,
      "SETOF": 225,
      "SET_DEFAULT": 226,
      "SET_NULL": 227,
      "SQL_SECURITY": 228,
      "STABLE": 229,
      "START": 230,
      "STATEMENT": 231,
      "STRICT": 232,
      "SUPPORT": 233,
      "TABLE": 234,
      "TABLESAMPLE": 235,
      "TABLESPACE": 236,
      "TEMP": 237,
      "TEMPORARY": 238,
      "THEN": 239,
      "TIME": 240,
      "TIMESTAMP": 241,
      "TIME_ZONE": 242,
      "TO": 243,
      "TRANSACTION": 244,
      "TRANSFORM_FOR_TYPE": 245,
      "TRIGGER": 246,
      "TRUE": 247,
      "TRUNCATE": 248,
      "UNBOUNDED_FOLLOWING": 249,
      "UNBOUNDED_PRECEDING": 250,
      "UNION": 251,
      "UNIQUE": 252,
      "UNSAFE": 253,
      "UPDATE": 254,
      "USAGE": 255,
      "USING": 256,
      "VALUES": 257,
      "VARIABLE": 258,
      "VARIADIC": 259,
      "VARYING": 260,
      "VERSION": 261,
      "VIEW": 262,
      "VOLATILE": 263,
      "WHEN": 264,
      "WHERE": 265,
      "WINDOW": 266,
      "WITH": 267,
      "WITHIN_GROUP": 268,
      "WITHOUT": 269,
      "WITHOUT_OIDS": 270,
      "WITH_GRANT_OPTION": 271,
      "WORK": 272,
      "[": 273,
      "]": 274,
      "^": 275,
      "`": 276,
      "alias": 277,
      "alignment": 278,
      "alter_owner": 279,
      "alter_sequence": 280,
      "alter_statement": 281,
      "alter_table": 282,
      "alter_table_action": 283,
      "alter_table_action_add": 284,
      "alter_table_action_alter_column": 285,
      "alter_table_action_set": 286,
      "alter_table_rename_column": 287,
      "analyze": 288,
      "argument_reference": 289,
      "array_element_access": 290,
      "array_type": 291,
      "assigment_expression": 292,
      "asterisk_expression": 293,
      "at_time_zone_expression": 294,
      "auto_increment_constraint": 295,
      "begin_statement": 296,
      "between_expression": 297,
      "binary_expression": 298,
      "binary_operator": 299,
      "boolean_expression": 300,
      "canonical": 301,
      "category": 302,
      "check": 303,
      "check_constraint": 304,
      "collatable": 305,
      "collation": 306,
      "column_definitions": 307,
      "column_names": 308,
      "comment": 309,
      "comment_statement": 310,
      "commit_statement": 311,
      "conditional_expression": 312,
      "constrained_type": 313,
      "content": 314,
      "create_domain_statement": 315,
      "create_extension_statement": 316,
      "create_function_parameter": 317,
      "create_function_parameters": 318,
      "create_function_statement": 319,
      "create_index_include_clause": 320,
      "create_index_statement": 321,
      "create_index_with_clause": 322,
      "create_materialized_view_statement": 323,
      "create_role_statement": 324,
      "create_schema_statement": 325,
      "create_sequence": 326,
      "create_statement": 327,
      "create_table_statement": 328,
      "create_trigger_statement": 329,
      "create_type_statement": 330,
      "create_view_statement": 331,
      "cte": 332,
      "cube_clause": 333,
      "data_hint": 334,
      "declare_statement": 335,
      "default": 336,
      "default_clause": 337,
      "delete_statement": 338,
      "delimiter": 339,
      "deterministic_hint": 340,
      "direction_constraint": 341,
      "distinct_from": 342,
      "dotted_name": 343,
      "drop_statement": 344,
      "element": 345,
      "exclude": 346,
      "exclude_entry": 347,
      "exists_expression": 348,
      "expression_list": 349,
      "external_hint": 350,
      "fetch_clause": 351,
      "filter_clause": 352,
      "foreign_key": 353,
      "frame_bound": 354,
      "frame_clause": 355,
      "frame_exclusion": 356,
      "frame_kind": 357,
      "from_clause": 358,
      "function_body": 359,
      "function_call": 360,
      "grant_statement": 361,
      "group_by_clause": 362,
      "group_expression": 363,
      "grouping_sets_clause": 364,
      "having_clause": 365,
      "identifier": 366,
      "in_expression": 367,
      "index_table_parameters": 368,
      "initial_mode": 369,
      "input": 370,
      "insert_statement": 371,
      "internallength": 372,
      "interval_expression": 373,
      "is_expression": 374,
      "join_clause": 375,
      "join_condition": 376,
      "join_type": 377,
      "json_access": 378,
      "language": 379,
      "like": 380,
      "limit_clause": 381,
      "mode": 382,
      "multirange_type_name": 383,
      "named_constraint": 384,
      "null_constraint": 385,
      "null_hint": 386,
      "number": 387,
      "offset_clause": 388,
      "on_delete_action": 389,
      "on_update_action": 390,
      "op_class": 391,
      "optimizer_hint": 392,
      "order_by_clause": 393,
      "order_expression": 394,
      "ordered_expression": 395,
      "output": 396,
      "over_clause": 397,
      "parallel_hint": 398,
      "partition_by_clause": 399,
      "passedbyvalue": 400,
      "pg_command": 401,
      "preferred": 402,
      "primary_key": 403,
      "primary_key_constraint": 404,
      "receive": 405,
      "references_constraint": 406,
      "rename": 407,
      "repeatable_clause": 408,
      "return_statement": 409,
      "rollback_statement": 410,
      "rollup_clause": 411,
      "schema": 412,
      "select_clause": 413,
      "select_clause_body": 414,
      "select_statement": 415,
      "select_subexpression": 416,
      "send": 417,
      "set_clause": 418,
      "set_clause_body": 419,
      "set_select_statement": 420,
      "set_statement": 421,
      "setof": 422,
      "source_file": 423,
      "sql_hint": 424,
      "sql_security_hint": 425,
      "storage": 426,
      "string": 427,
      "subscript": 428,
      "subtype": 429,
      "subtype_diff": 430,
      "subtype_opclass": 431,
      "table_column": 432,
      "table_parameters": 433,
      "tablesample_clause": 434,
      "tablespace_hint": 435,
      "time": 436,
      "trigger_body": 437,
      "trigger_condition": 438,
      "trigger_event": 439,
      "trigger_order": 440,
      "trigger_preferencing": 441,
      "trigger_reference": 442,
      "trigger_time": 443,
      "truncate_statement": 444,
      "tuple": 445,
      "type": 446,
      "type_cast": 447,
      "type_spec_base": 448,
      "type_spec_composite": 449,
      "type_spec_enum": 450,
      "type_spec_range": 451,
      "typmod_in": 452,
      "typmod_out": 453,
      "unary_expression": 454,
      "unique": 455,
      "unique_constraint": 456,
      "update_statement": 457,
      "using_clause": 458,
      "values_clause": 459,
      "values_clause_item": 460,
      "version": 461,
      "view_body": 462,
      "view_check_option": 463,
      "view_columns": 464,
      "view_option": 465,
      "view_options": 466,
      "where_clause": 467,
      "window_clause": 468,
      "window_definition": 469,
      "with_clause": 470,
      "within_group_clause": 471,
      "|": 472,
      "|/": 473,
      "||": 474,
      "||/": 475,
      "~": 476,
      "~*": 477
    },
    "unk_token": "<unk>"
  }
}