{
  "version": "1.0",
  "truncation": null,
  "padding": null,
  "added_tokens": [
    {
      "id": 0,
      "content": "<pad>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 1,
      "content": "<sos>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 2,
      "content": "<eos>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 3,
      "content": "<unk>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 4,
      "content": "<tb>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 5,
      "content": "</tb>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 6,
      "content": "<col>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    }
  ],
  "normalizer": null,
  "pre_tokenizer": null,
  "post_processor": null,
  "decoder": null,
  "model": {
    "type": "WordLevel",
    "vocab": {
      "<pad>": 0,
      "<sos>": 1,
      "<eos>": 2,
      "<unk>": 3,
      "<tb>": 4,
      "</tb>": 5,
      "<col>": 6,
      "!!": 7,
      "!=": 8,
      "!~": 9,
      "!~*": 10,
      "\"": 11,
      "#": 12,
      "#>": 13,
      "#>>": 14,
      "$": 15,
      "%": 16,
      "&": 17,
      "&&": 18,
      "'": 19,
      "(": 20,
      ")": 21,
      "*": 22,
      "+": 23,
      ",": 24,
      "-": 25,
      "->": 26,
      "->>": 27,
      ".": 28,
      ".*": 29,
      "/": 30,
      ":": 31,
      "::": 32,
      ";": 33,
      "<": 34,
      "<<": 35,
      "<=": 36,
      "<>": 37,
      "=": 38,
      ">": 39,
      ">=": 40,
      ">>": 41,
      "@": 42,
      "ADD": 43,
      "AFTER": 44,
      "ALL": 45,
      "ALTER": 46,
      "ALTER_COLUMN": 47,
      "AND": 48,
      "AS": 49,
      "ASC": 50,
      "AT": 51,
      "ATOMIC": 52,
      "AT_TIME_ZONE": 53,
      "AUTO_INCREMENT": 54,
      "BEFORE": 55,
      "BEGIN": 56,
      "BETWEEN": 57,
      "BY": 58,
      "CACHE": 59,
      "CALLED_ON_NULL_INPUT": 60,
      "CASCADE": 61,
      "CASCADED": 62,
      "CASE": 63,
      "CHECK": 64,
      "CHECK_OPTION": 65,
      "COLUMN": 66,
      "COMMENT_ON": 67,
      "COMMIT": 68,
      "CONCURRENTLY": 69,
      "CONSTRAINT": 70,
      "CONTAINS_SQL": 71,
      "COST": 72,
      "CREATE": 73,
      "CREATE_DOMAIN": 74,
      "CREATE_EXTENSION": 75,
      "CREATE_MATERIALIZED_VIEW": 76,
      "CREATE_OR_REPLACE_FUNCTION": 77,
      "CREATE_OR_REPLACE_PROCEDURE": 78,
      "CREATE_ROLE": 79,
      "CREATE_SCHEMA": 80,
      "CREATE_TYPE": 81,
      "CROSS": 82,
      "CUBE": 83,
      "CURRENT_ROLE": 84,
      "CURRENT_ROW": 85,
      "CURRENT_USER": 86,
      "DATA": 87,
      "DATABASE": 88,
      "DATE": 89,
      "DATETIME": 90,
      "DECLARE": 91,
      "DEFAULT": 92,
      "DEFERRABLE": 93,
      "DEFERRED": 94,
      "DEFINER": 95,
      "DELETE": 96,
      "DESC": 97,
      "DETERMINISTIC": 98,
      "DISTINCT": 99,
      "DISTINCT_FROM": 100,
      "DROP": 101,
      "EACH": 102,
      "ELSE": 103,
      "END": 104,
      "ENUM": 105,
      "EXCEPT": 106,
      "EXCLUDE": 107,
      "EXCLUDE_CURRENT_ROW": 108,
      "EXCLUDE_GROUP": 109,
      "EXCLUDE_NO_OTHERS": 110,
      "EXCLUDE_TIES": 111,
      "EXECUTE": 112,
      "EXISTS": 113,
      "EXTENSION": 114,
      "EXTERNAL": 115,
      "FALSE": 116,
      "FETCH": 117,
      "FILTER": 118,
      "FIRST": 119,
      "FOLLOWING": 120,
      "FOLLOWS": 121,
      "FOR": 122,
      "FOREIGN_KEY": 123,
      "FROM": 124,
      "FULL": 125,
      "FUNCTION": 126,
      "GRANT": 127,
      "GROUP": 128,
      "GROUPING_SETS": 129,
      "GROUPS": 130,
      "GROUP_BY": 131,
      "HAVING": 132,
      "IF": 133,
      "IF_EXISTS": 134,
      "IF_NOT_EXISTS": 135,
      "IMMEDIATE": 136,
      "IMMUTABLE": 137,
      "IN": 138,
      "INCLUDE": 139,
      "INCREMENT": 140,
      "INDEX": 141,
      "INITIALLY": 142,
      "INNER": 143,
      "INOUT": 144,
      "INSERT": 145,
      "INSTEAD_OF": 146,
      "INTERSECT": 147,
      "INTO": 148,
      "INVOKER": 149,
      "IS": 150,
      "JOIN": 151,
      "LANGUAGE": 152,
      "LAST": 153,
      "LATERAL": 154,
      "LEAKPROOF": 155,
      "LEFT": 156,
      "LIKE": 157,
      "LIMIT": 158,
      "LOCAL": 159,
      "MATERIALIZED": 160,
      "MATERIALIZED_VIEW": 161,
      "MAXVALUE": 162,
      "MINVALUE": 163,
      "MODIFIES_SQL_DATA": 164,
      "NATURAL": 165,
      "NEW": 166,
      "NEXT": 167,
      "NO": 168,
      "NOT": 169,
      "NOT_DEFERRABLE": 170,
      "NOT_LIKE": 171,
      "NO_SQL": 172,
      "NULL": 173,
      "NULLS": 174,
      "OF": 175,
      "OFFSET": 176,
      "OLD": 177,
      "ON": 178,
      "ONLY": 179,
      "ON_DELETE": 180,
      "ON_UPDATE": 181,
      "OR": 182,
      "ORDER_BY": 183,
      "OR_REPLACE": 184,
      "OUT": 185,
      "OUTER": 186,
      "OVER": 187,
      "OWNED_BY": 188,
      "OWNER_TO": 189,
      "PARALLEL": 190,
      "PARTITION_BY": 191,
      "PRECEDES": 192,
      "PRECEDING": 193,
      "PRECISION": 194,
      "PRIMARY_KEY": 195,
      "PRIVILEGES": 196,
      "PROCEDURE": 197,
      "PUBLIC": 198,
      "RANGE": 199,
      "READS_SQL_DATA": 200,
      "RECURSIVE": 201,
      "REFERENCES": 202,
      "REFERENCING": 203,
      "RENAME": 204,
      "RENAME_TO": 205,
      "REPEATABLE": 206,
      "RESTRICT": 207,
      "RESTRICTED": 208,
      "RETURN": 209,
      "RETURNS": 210,
      "RETURNS_NULL_ON_NULL_INPUT": 211,
      "RIGHT": 212,
      "ROLLBACK": 213,
      "ROLLUP": 214,
      "ROW": 215,
      "ROWS": 216,
      "SAFE": 217,
      "SCHEMA": 218,
      "SECURITY_DEFINER": 219,
      "SECURITY_INVOKER": 220,
      "SELECT": 221,
      "SEQUENCE": 222,
      "SESSION": 223,
      "SESSION_USER": 224,
      "SET": 225,
      "SETOF": 226,
      "SET_DEFAULT": 227,
      "SET_NULL": 228,
      "SQL_SECURITY": 229,
      "STABLE": 230,
      "START": 231,
      "STATEMENT": 232,
      "STRICT": 233,
      "SUPPORT": 234,
      "TABLE": 235,
      "TABLESAMPLE": 236,
      "TABLESPACE": 237,
      "TEMP": 238,
      "TEMPORARY": 239,
      "THEN": 240,
      "TIME": 241,
      "TIMESTAMP": 242,
      "TIME_ZONE": 243,
      "TO": 244,
      "TRANSACTION": 245,
      "TRANSFORM_FOR_TYPE": 246,
      "TRIGGER": 247,
      "TRUE": 248,
      "TRUNCATE": 249,
      "UNBOUNDED_FOLLOWING": 250,
      "UNBOUNDED_PRECEDING": 251,
      "UNION": 252,
      "UNIQUE": 253,
      "UNSAFE": 254,
      "UPDATE": 255,
      "USAGE": 256,
      "USING": 257,
      "VALUES": 258,
      "VARIABLE": 259,
      "VARIADIC": 260,
      "VARYING": 261,
      "VERSION": 262,
      "VIEW": 263,
      "VOLATILE": 264,
      "WHEN": 265,
      "WHERE": 266,
      "WINDOW": 267,
      "WITH": 268,
      "WITHIN_GROUP": 269,
      "WITHOUT": 270,
      "WITHOUT_OIDS": 271,
      "WITH_GRANT_OPTION": 272,
      "WORK": 273,
      "[": 274,
      "]": 275,
      "^": 276,
      "`": 277,
      "alias": 278,
      "alignment": 279,
      "alter_owner": 280,
      "alter_sequence": 281,
      "alter_statement": 282,
      "alter_table": 283,
      "alter_table_action": 284,
      "alter_table_action_add": 285,
      "alter_table_action_alter_column": 286,
      "alter_table_action_set": 287,
      "alter_table_rename_column": 288,
      "analyze": 289,
      "argument_reference": 290,
      "array_element_access": 291,
      "array_type": 292,
      "assigment_expression": 293,
      "asterisk_expression": 294,
      "at_time_zone_expression": 295,
      "auto_increment_constraint": 296,
      "begin_statement": 297,
      "between_expression": 298,
      "binary_expression": 299,
      "binary_operator": 300,
      "boolean_expression": 301,
      "canonical": 302,
      "category": 303,
      "check": 304,
      "check_constraint": 305,
      "collatable": 306,
      "collation": 307,
      "column_definitions": 308,
      "column_names": 309,
      "comment": 310,
      "comment_statement": 311,
      "commit_statement": 312,
      "conditional_expression": 313,
      "constrained_type": 314,
      "content": 315,
      "create_domain_statement": 316,
      "create_extension_statement": 317,
      "create_function_parameter": 318,
      "create_function_parameters": 319,
      "create_function_statement": 320,
      "create_index_include_clause": 321,
      "create_index_statement": 322,
      "create_index_with_clause": 323,
      "create_materialized_view_statement": 324,
      "create_role_statement": 325,
      "create_schema_statement": 326,
      "create_sequence": 327,
      "create_statement": 328,
      "create_table_statement": 329,
      "create_trigger_statement": 330,
      "create_type_statement": 331,
      "create_view_statement": 332,
      "cte": 333,
      "cube_clause": 334,
      "data_hint": 335,
      "declare_statement": 336,
      "default": 337,
      "default_clause": 338,
      "delete_statement": 339,
      "delimiter": 340,
      "deterministic_hint": 341,
      "direction_constraint": 342,
      "distinct_from": 343,
      "dotted_name": 344,
      "drop_statement": 345,
      "element": 346,
      "exclude": 347,
      "exclude_entry": 348,
      "exists_expression": 349,
      "expression_list": 350,
      "external_hint": 351,
      "fetch_clause": 352,
      "filter_clause": 353,
      "foreign_key": 354,
      "frame_bound": 355,
      "frame_clause": 356,
      "frame_exclusion": 357,
      "frame_kind": 358,
      "from_clause": 359,
      "function_body": 360,
      "function_call": 361,
      "grant_statement": 362,
      "group_by_clause": 363,
      "group_expression": 364,
      "grouping_sets_clause": 365,
      "having_clause": 366,
      "identifier": 367,
      "in_expression": 368,
      "index_table_parameters": 369,
      "initial_mode": 370,
      "input": 371,
      "insert_statement": 372,
      "internallength": 373,
      "interval_expression": 374,
      "is_expression": 375,
      "join_clause": 376,
      "join_condition": 377,
      "join_type": 378,
      "json_access": 379,
      "language": 380,
      "like": 381,
      "limit_clause": 382,
      "mode": 383,
      "multirange_type_name": 384,
      "named_constraint": 385,
      "null_constraint": 386,
      "null_hint": 387,
      "number": 388,
      "offset_clause": 389,
      "on_delete_action": 390,
      "on_update_action": 391,
      "op_class": 392,
      "optimizer_hint": 393,
      "order_by_clause": 394,
      "order_expression": 395,
      "ordered_expression": 396,
      "output": 397,
      "over_clause": 398,
      "parallel_hint": 399,
      "partition_by_clause": 400,
      "passedbyvalue": 401,
      "pg_command": 402,
      "preferred": 403,
      "primary_key": 404,
      "primary_key_constraint": 405,
      "receive": 406,
      "references_constraint": 407,
      "rename": 408,
      "repeatable_clause": 409,
      "return_statement": 410,
      "rollback_statement": 411,
      "rollup_clause": 412,
      "schema": 413,
      "select_clause": 414,
      "select_clause_body": 415,
      "select_statement": 416,
      "select_subexpression": 417,
      "send": 418,
      "set_clause": 419,
      "set_clause_body": 420,
      "set_select_statement": 421,
      "set_statement": 422,
      "setof": 423,
      "source_file": 424,
      "sql_hint": 425,
      "sql_security_hint": 426,
      "storage": 427,
      "string": 428,
      "subscript": 429,
      "subtype": 430,
      "subtype_diff": 431,
      "subtype_opclass": 432,
      "table_column": 433,
      "table_parameters": 434,
      "tablesample_clause": 435,
      "tablespace_hint": 436,
      "time": 437,
      "trigger_body": 438,
      "trigger_condition": 439,
      "trigger_event": 440,
      "trigger_order": 441,
      "trigger_preferencing": 442,
      "trigger_reference": 443,
      "trigger_time": 444,
      "truncate_statement": 445,
      "tuple": 446,
      "type": 447,
      "type_cast": 448,
      "type_spec_base": 449,
      "type_spec_composite": 450,
      "type_spec_enum": 451,
      "type_spec_range": 452,
      "typmod_in": 453,
      "typmod_out": 454,
      "unary_expression": 455,
      "unique": 456,
      "unique_constraint": 457,
      "update_statement": 458,
      "using_clause": 459,
      "values_clause": 460,
      "values_clause_item": 461,
      "version": 462,
      "view_body": 463,
      "view_check_option": 464,
      "view_columns": 465,
      "view_option": 466,
      "view_options": 467,
      "where_clause": 468,
      "window_clause": 469,
      "window_definition": 470,
      "with_clause": 471,
      "within_group_clause": 472,
      "|": 473,
      "|/": 474,
      "||": 475,
      "||/": 476,
      "~": 477,
      "~*": 478
    },
    "unk_token": "<unk>"
  }
}