{
  "version": "1.0",
  "truncation": null,
  "padding": null,
  "added_tokens": [
    {
      "id": 0,
      "content": "<pad>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 1,
      "content": "<sos>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 2,
      "content": "<eos>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 3,
      "content": "<unk>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 4,
      "content": "<tb>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 5,
      "content": "</tb>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 6,
      "content": "<col>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    }
  ],
  "normalizer": null,
  "pre_tokenizer": null,
  "post_processor": null,
  "decoder": null,
  "model": {
    "type": "WordLevel",
    "vocab": {
      "<pad>": 0,
      "<sos>": 1,
      "<eos>": 2,
      "<unk>": 3,
      "<tb>": 4,
      "</tb>": 5,
      "<col>": 6,
      "source_file(select_statement)": 7,
      "select_clause(SELECT, select_clause_body)": 8,
      "from_clause(join_table_1)": 9,
      "binary_expression(identifier, range_operator, number)": 10,
      "binary_expression(identifier, =, identifier)": 11,
      "select_clause_body(asterisk_expression(*))": 12,
      "join_clause(identifier, JOIN, identifier, join_condition(ON, boolean_expression(binary_expression, AND, boolean_expression)))": 13,
      "limit_clause(LIMIT, number)": 14,
      "from_clause(join_table_2)": 15,
      "is_expression(identifier, IS, NULL)": 16,
      "in_expression(identifier, IN, tuple)": 17,
      "binary_expression(identifier, =, number)": 18,
      "boolean_expression(binary_expression(identifier, =, identifier), AND, binary_expression(identifier, range_operator, number))": 19,
      "binary_expression(identifier, <>, number)": 20,
      "order_by_clause(order_expression(identifier, DESC))": 21,
      "order_by_clause(order_expression(identifier))": 22,
      "join_clause(identifier, JOIN, identifier, join_condition(ON, binary_expression(identifier, =, identifier)))": 23,
      "boolean_expression(binary_expression(identifier, range_operator, number), AND, boolean_expression(binary_expression, AND, boolean_expression))": 24,
      "tuple(number)": 25,
      "where_clause(WHERE, binary_expression(identifier, range_operator, number))": 26,
      "select_clause_body(identifier)": 27,
      "boolean_expression(binary_expression(identifier, range_operator, number), AND, boolean_expression(binary_expression, AND, binary_expression))": 28,
      "join_clause(join_clause, JOIN, identifier, join_condition(ON, binary_expression(identifier, =, identifier)))": 29,
      "join_clause(join_clause, JOIN, identifier, join_condition(ON, boolean_expression(binary_expression, AND, boolean_expression)))": 30,
      "join_clause(identifier, JOIN, identifier, join_condition(ON, boolean_expression(binary_expression, AND, binary_expression)))": 31,
      "binary_expression(identifier, =, string)": 32,
      "binary_expression(identifier, <>, string)": 33,
      "select_statement(set_select_statement)": 34,
      "from_clause(identifier)": 35,
      "select_statement(select_clause, from_clause, where_clause)": 36,
      "binary_expression(identifier, LIKE, string)": 37,
      "tuple(string)": 38,
      "boolean_expression(NOT, is_expression)": 39,
      "exists_expression(EXISTS, select_subexpression)": 40,
      "boolean_expression(binary_expression(identifier, range_operator, number), AND, binary_expression(identifier, range_operator, number))": 41,
      "from_clause(join_table_3)": 42,
      "boolean_expression(NOT, in_expression)": 43,
      "select_statement(select_clause, from_clause)": 44,
      "boolean_expression(binary_expression(identifier, range_operator, number), OR, binary_expression(identifier, range_operator, number))": 45,
      "binary_expression(identifier, range_operator, identifier)": 46,
      "where_clause(WHERE, boolean_expression(binary_expression, AND, binary_expression))": 47,
      "select_statement(select_clause, from_clause, where_clause, limit_clause)": 48,
      "select_clause_body(number)": 49,
      "boolean_expression(binary_expression(identifier, =, identifier), AND, boolean_expression(binary_expression, OR, boolean_expression))": 50,
      "select_statement(select_clause, from_clause, where_clause, order_by_clause)": 51,
      "join_clause(join_clause, JOIN, identifier, join_condition(ON, boolean_expression(binary_expression, AND, binary_expression)))": 52,
      "boolean_expression(binary_expression(identifier, range_operator, number), OR, boolean_expression(binary_expression, OR, boolean_expression))": 53,
      "boolean_expression(boolean_expression(binary_expression, AND, boolean_expression), AND, is_expression)": 54,
      "boolean_expression(binary_expression(identifier, =, identifier), AND, boolean_expression(binary_expression, AND, boolean_expression))": 55,
      "select_statement(select_clause, from_clause, limit_clause)": 56,
      "boolean_expression(binary_expression(identifier, =, identifier), AND, is_expression)": 57,
      "group_by_clause(group_expression(identifier))": 58,
      "boolean_expression(binary_expression(identifier, =, identifier), AND, in_expression)": 59,
      "boolean_expression(binary_expression(identifier, =, identifier), AND, binary_expression(identifier, =, number))": 60,
      "boolean_expression(binary_expression(identifier, <>, number), AND, binary_expression(identifier, =, identifier))": 61,
      "where_clause(WHERE, binary_expression(identifier, =, number))": 62,
      "boolean_expression(binary_expression(identifier, =, number), AND, boolean_expression(binary_expression, AND, boolean_expression))": 63,
      "boolean_expression(NOT, exists_expression)": 64,
      "where_clause(WHERE, binary_expression(identifier, <>, number))": 65,
      "with_clause(cte(identifier, AS, select_statement(select_clause, from_clause, where_clause)))": 66,
      "boolean_expression(boolean_expression(binary_expression, AND, boolean_expression), AND, in_expression)": 67,
      "with_clause(cte(identifier, AS, select_statement(set_select_statement)))": 68,
      "select_statement(select_clause, from_clause, order_by_clause)": 69,
      "select_statement(with_clause, select_clause, from_clause, where_clause)": 70,
      "boolean_expression(binary_expression(identifier, <>, number), AND, boolean_expression(binary_expression, AND, boolean_expression))": 71,
      "where_clause(WHERE, boolean_expression(binary_expression, AND, boolean_expression))": 72,
      "binary_expression(identifier, arithmetic_operator, identifier)": 73,
      "select_clause(SELECT, DISTINCT, select_clause_body)": 74,
      "binary_expression(identifier, arithmetic_operator, number)": 75,
      "set_select_statement(select_statement, UNION, select_statement)": 76,
      "set_select_statement(select_statement, EXCEPT, select_statement)": 77,
      "set_select_statement(select_statement, INTERSECT, select_statement)": 78,
      "set_select_statement(select_statement, EXCEPT, ALL, select_statement)": 79,
      "set_select_statement(select_statement, INTERSECT, ALL, select_statement)": 80,
      "set_select_statement(select_statement, UNION, ALL, select_statement)": 81,
      "select_statement(select_clause, from_clause, where_clause, order_by_clause, limit_clause)": 82,
      "select_clause_body(time)": 83,
      "boolean_expression(binary_expression(identifier, =, string), AND, boolean_expression(binary_expression, AND, boolean_expression))": 84,
      "select_clause_body(function_call(COUNT))": 85,
      "boolean_expression(binary_expression(identifier, <>, string), AND, boolean_expression(binary_expression, AND, boolean_expression))": 86,
      "join_clause(identifier, JOIN, identifier, join_condition(ON, boolean_expression(boolean_expression, AND, is_expression)))": 87,
      "boolean_expression(binary_expression(identifier, range_operator, number), OR, boolean_expression(binary_expression, OR, binary_expression))": 88,
      "where_clause(WHERE, in_expression)": 89,
      "boolean_expression(binary_expression(identifier, =, identifier), AND, boolean_expression(binary_expression, OR, binary_expression))": 90,
      "where_clause(WHERE, is_expression)": 91,
      "select_statement(with_clause, select_clause, from_clause)": 92,
      "over_clause(OVER, window_definition)": 93,
      "boolean_expression(binary_expression(identifier, =, identifier), AND, boolean_expression(boolean_expression, AND, boolean_expression))": 94,
      "with_clause(cte(identifier, AS, select_statement(select_clause, from_clause, where_clause, limit_clause)))": 95,
      "select_statement(with_clause, select_clause, from_clause, where_clause, limit_clause)": 96,
      "boolean_expression(binary_expression(identifier, =, identifier), AND, boolean_expression(NOT, is_expression))": 97,
      "select_clause_body(conditional_expression)": 98,
      "select_statement(select_clause, from_clause, order_by_clause, limit_clause)": 99,
      "boolean_expression(NOT, binary_expression(identifier, LIKE, string))": 100,
      "boolean_expression(binary_expression(identifier, range_operator, number), AND, boolean_expression(boolean_expression, AND, is_expression))": 101,
      "join_clause(identifier, JOIN, identifier, join_condition(ON, boolean_expression(boolean_expression, AND, in_expression)))": 102,
      "boolean_expression(boolean_expression(binary_expression, AND, binary_expression), AND, is_expression)": 103,
      "with_clause(cte(identifier, AS, select_statement(select_clause, from_clause)))": 104,
      "function_call(NULLIF, identifier, number)": 105,
      "boolean_expression(binary_expression(identifier, =, identifier), AND, binary_expression(identifier, =, string))": 106,
      "select_statement(with_clause, select_clause, from_clause, where_clause, order_by_clause)": 107,
      "function_call(AVG, identifier)": 108,
      "function_call(MIN, identifier)": 109,
      "function_call(MAX, identifier)": 110,
      "function_call(SUM, identifier)": 111,
      "function_call(COUNT, identifier)": 112,
      "boolean_expression(binary_expression(identifier, =, identifier), AND, boolean_expression(binary_expression, AND, binary_expression))": 113,
      "boolean_expression(binary_expression(identifier, =, identifier), AND, boolean_expression(NOT, in_expression))": 114,
      "boolean_expression(binary_expression(identifier, <>, string), AND, binary_expression(identifier, =, identifier))": 115,
      "with_clause(cte(identifier, AS, select_statement(select_clause, from_clause, where_clause, order_by_clause)))": 116,
      "binary_expression(binary_expression(identifier, arithmetic_operator, number), arithmetic_operator, identifier)": 117,
      "join_clause(identifier, JOIN, identifier, join_condition(ON, boolean_expression(binary_expression, AND, is_expression)))": 118,
      "boolean_expression(boolean_expression(binary_expression, AND, binary_expression), AND, in_expression)": 119,
      "boolean_expression(binary_expression(identifier, =, number), AND, boolean_expression(binary_expression, AND, binary_expression))": 120,
      "boolean_expression(binary_expression(identifier, <>, number), AND, boolean_expression(binary_expression, AND, binary_expression))": 121,
      "boolean_expression(binary_expression(identifier, range_operator, identifier), AND, binary_expression(identifier, range_operator, number))": 122,
      "binary_expression(binary_expression(binary_expression, arithmetic_operator, identifier), range_operator, number)": 123,
      "boolean_expression(binary_expression(identifier, range_operator, number), AND, boolean_expression(boolean_expression, AND, in_expression))": 124,
      "join_clause(identifier, JOIN, identifier, join_condition(ON, boolean_expression(binary_expression, AND, in_expression)))": 125,
      "select_clause_body(function_call(SUM))": 126,
      "select_clause_body(function_call(AVG))": 127,
      "select_subexpression(select_statement(select_clause, from_clause, where_clause))": 128,
      "binary_expression(function_call(NULLIF), arithmetic_operator, identifier)": 129,
      "select_statement(with_clause, select_clause, from_clause, limit_clause)": 130,
      "boolean_expression(binary_expression(identifier, LIKE, string), AND, boolean_expression(binary_expression, AND, boolean_expression))": 131,
      "binary_expression(binary_expression(identifier, arithmetic_operator, identifier), range_operator, number)": 132,
      "boolean_expression(boolean_expression(binary_expression, AND, boolean_expression), AND, boolean_expression(binary_expression, OR, binary_expression))": 133,
      "binary_expression(identifier, <>, identifier)": 134,
      "select_statement(with_clause, select_clause, from_clause, order_by_clause)": 135,
      "boolean_expression(binary_expression(identifier, =, identifier), AND, binary_expression(identifier, LIKE, string))": 136,
      "with_clause(cte(identifier, AS, select_statement(select_clause, from_clause, limit_clause)))": 137,
      "boolean_expression(binary_expression(binary_expression, range_operator, number), AND, binary_expression(identifier, =, identifier))": 138,
      "boolean_expression(binary_expression(identifier, range_operator, number), AND, boolean_expression(binary_expression, AND, is_expression))": 139,
      "select_statement(with_clause, select_clause, from_clause, where_clause, order_by_clause, limit_clause)": 140,
      "function_call(COUNT, asterisk_expression(*))": 141,
      "join_clause(identifier, JOIN, identifier, join_condition(ON, boolean_expression(boolean_expression, AND, boolean_expression)))": 142,
      "with_clause(cte(identifier, AS, select_statement(select_clause, from_clause, where_clause, order_by_clause, limit_clause)))": 143,
      "boolean_expression(binary_expression(identifier, range_operator, number), AND, boolean_expression(binary_expression, AND, in_expression))": 144,
      "boolean_expression(binary_expression(identifier, <>, number), AND, binary_expression(identifier, range_operator, number))": 145,
      "boolean_expression(binary_expression(identifier, =, string), AND, boolean_expression(binary_expression, AND, binary_expression))": 146,
      "boolean_expression(binary_expression(identifier, =, number), AND, binary_expression(identifier, range_operator, number))": 147,
      "boolean_expression(binary_expression(identifier, =, number), OR, binary_expression(identifier, range_operator, number))": 148,
      "with_clause(cte(identifier, AS, select_statement(select_clause, from_clause, order_by_clause)))": 149,
      "boolean_expression(boolean_expression(binary_expression, OR, boolean_expression), OR, is_expression)": 150,
      "boolean_expression(binary_expression(identifier, <>, number), OR, binary_expression(identifier, range_operator, number))": 151,
      "boolean_expression(binary_expression(identifier, <>, string), AND, boolean_expression(binary_expression, AND, binary_expression))": 152,
      "partition_by_clause(PARTITION_BY, PARTITION_BY, identifier)": 153,
      "select_subexpression(select_statement(select_clause, from_clause))": 154,
      "select_clause_body(function_call(MAX))": 155,
      "select_subexpression(select_statement(select_clause, from_clause, where_clause, limit_clause))": 156,
      "select_clause_body(function_call(MIN))": 157,
      "boolean_expression(binary_expression(identifier, <>, number), OR, boolean_expression(binary_expression, OR, boolean_expression))": 158,
      "boolean_expression(binary_expression(identifier, range_operator, number), OR, is_expression)": 159,
      "boolean_expression(binary_expression(identifier, =, number), OR, boolean_expression(binary_expression, OR, boolean_expression))": 160,
      "from_clause(join_table_4)": 161,
      "boolean_expression(boolean_expression(binary_expression, OR, boolean_expression), AND, boolean_expression(boolean_expression, AND, boolean_expression))": 162,
      "function_call(NULLIF, number, number)": 163,
      "boolean_expression(boolean_expression(binary_expression, OR, boolean_expression), OR, in_expression)": 164,
      "boolean_expression(binary_expression(identifier, range_operator, number), AND, is_expression)": 165,
      "select_statement(with_clause, select_clause, from_clause, order_by_clause, limit_clause)": 166,
      "where_clause(WHERE, boolean_expression(binary_expression, OR, boolean_expression))": 167,
      "boolean_expression(binary_expression(identifier, range_operator, number), OR, in_expression)": 168,
      "having_clause(HAVING, binary_expression(identifier, range_operator, number))": 169,
      "join_clause(join_clause, JOIN, identifier, join_condition(ON, boolean_expression(boolean_expression, AND, boolean_expression)))": 170,
      "boolean_expression(boolean_expression(binary_expression, OR, boolean_expression), AND, boolean_expression(binary_expression, OR, boolean_expression))": 171,
      "join_clause(join_clause, JOIN, identifier, join_condition(ON, boolean_expression(boolean_expression, AND, is_expression)))": 172,
      "where_clause(WHERE, boolean_expression(NOT, is_expression))": 173,
      "where_clause(WHERE, boolean_expression(NOT, in_expression))": 174,
      "where_clause(WHERE, boolean_expression(binary_expression, OR, binary_expression))": 175,
      "conditional_expression(CASE, WHEN, binary_expression(identifier, =, number), THEN, identifier, END)": 176,
      "boolean_expression(binary_expression(identifier, range_operator, number), AND, in_expression)": 177,
      "boolean_expression(binary_expression(binary_expression, range_operator, number), AND, boolean_expression(binary_expression, AND, boolean_expression))": 178,
      "boolean_expression(binary_expression(identifier, range_operator, number), AND, boolean_expression(boolean_expression, AND, boolean_expression))": 179,
      "where_clause(WHERE, boolean_expression(binary_expression, AND, exists_expression))": 180,
      "join_clause(identifier, JOIN, identifier, join_condition(ON, binary_expression(identifier, range_operator, identifier)))": 181,
      "boolean_expression(boolean_expression(binary_expression, AND, boolean_expression), AND, boolean_expression(binary_expression, OR, boolean_expression))": 182,
      "join_clause(join_clause, JOIN, identifier, join_condition(ON, boolean_expression(boolean_expression, AND, in_expression)))": 183,
      "boolean_expression(binary_expression(identifier, range_operator, number), AND, boolean_expression(NOT, exists_expression))": 184,
      "where_clause(WHERE, boolean_expression(NOT, exists_expression))": 185,
      "where_clause(WHERE, exists_expression)": 186,
      "binary_expression(identifier, range_operator, time)": 187,
      "with_clause(cte(identifier, AS, select_statement(select_clause, from_clause, order_by_clause, limit_clause)))": 188,
      "select_subexpression(select_statement(select_clause, from_clause, where_clause, order_by_clause))": 189,
      "select_subexpression(select_statement(select_clause, from_clause, limit_clause))": 190,
      "boolean_expression(binary_expression(identifier, =, string), OR, boolean_expression(binary_expression, OR, boolean_expression))": 191,
      "boolean_expression(binary_expression(identifier, range_operator, number), OR, boolean_expression(boolean_expression, OR, is_expression))": 192,
      "boolean_expression(binary_expression(identifier, =, identifier), AND, boolean_expression(NOT, binary_expression))": 193,
      "boolean_expression(binary_expression(identifier, range_operator, number), OR, boolean_expression(NOT, is_expression))": 194,
      "boolean_expression(binary_expression(identifier, <>, string), OR, boolean_expression(binary_expression, OR, boolean_expression))": 195,
      "boolean_expression(binary_expression(identifier, LIKE, string), AND, boolean_expression(binary_expression, AND, binary_expression))": 196,
      "where_clause(WHERE, boolean_expression(binary_expression, AND, in_expression))": 197,
      "where_clause(WHERE, boolean_expression(binary_expression, AND, is_expression))": 198,
      "binary_expression(function_call(NULLIF), arithmetic_operator, number)": 199,
      "boolean_expression(binary_expression(identifier, range_operator, number), AND, exists_expression)": 200,
      "boolean_expression(binary_expression(identifier, range_operator, number), AND, boolean_expression(NOT, is_expression))": 201,
      "boolean_expression(binary_expression(identifier, range_operator, number), OR, boolean_expression(boolean_expression, OR, in_expression))": 202,
      "join_clause(join_clause, JOIN, identifier, join_condition(ON, boolean_expression(binary_expression, AND, is_expression)))": 203,
      "boolean_expression(boolean_expression(binary_expression, OR, binary_expression), AND, boolean_expression(boolean_expression, AND, boolean_expression))": 204,
      "boolean_expression(binary_expression(identifier, range_operator, number), OR, boolean_expression(NOT, in_expression))": 205,
      "boolean_expression(binary_expression(identifier, =, identifier), AND, boolean_expression(NOT, exists_expression))": 206,
      "function_call(RANK, over_clause)": 207,
      "select_clause_body(function_call(RANK))": 208,
      "window_definition(order_by_clause)": 209,
      "function_call(SUM, identifier, over_clause)": 210,
      "function_call(COUNT, identifier, over_clause)": 211,
      "binary_expression(binary_expression(function_call, arithmetic_operator, identifier), range_operator, number)": 212,
      "order_by_clause(order_expression(function_call(AVG), DESC))": 213,
      "order_by_clause(order_expression(function_call(AVG)))": 214,
      "function_call(AVG, identifier, over_clause)": 215,
      "window_definition(partition_by_clause, order_by_clause)": 216,
      "boolean_expression(binary_expression(identifier, range_operator, number), AND, boolean_expression(NOT, in_expression))": 217,
      "window_definition(partition_by_clause)": 218,
      "order_by_clause(order_expression(function_call(MAX), DESC))": 219,
      "order_by_clause(order_expression(function_call(MIN)))": 220,
      "order_by_clause(order_expression(function_call(MAX)))": 221,
      "order_by_clause(order_expression(function_call(SUM)))": 222,
      "boolean_expression(binary_expression(identifier, =, string), OR, binary_expression(identifier, range_operator, number))": 223,
      "order_by_clause(order_expression(function_call(MIN), DESC))": 224,
      "join_clause(join_clause, JOIN, identifier, join_condition(ON, boolean_expression(binary_expression, AND, in_expression)))": 225,
      "order_by_clause(order_expression(function_call(COUNT), DESC))": 226,
      "order_by_clause(order_expression(function_call(COUNT)))": 227,
      "order_by_clause(order_expression(function_call(SUM), DESC))": 228,
      "boolean_expression(binary_expression(identifier, <>, string), OR, binary_expression(identifier, range_operator, number))": 229,
      "boolean_expression(binary_expression(identifier, range_operator, number), OR, boolean_expression(boolean_expression, OR, boolean_expression))": 230,
      "boolean_expression(binary_expression(identifier, =, identifier), AND, boolean_expression(boolean_expression, OR, is_expression))": 231,
      "conditional_expression(CASE, WHEN, binary_expression(identifier, =, number), THEN, identifier, ELSE, number, END)": 232,
      "boolean_expression(binary_expression(identifier, range_operator, number), OR, boolean_expression(binary_expression, OR, is_expression))": 233,
      "conditional_expression(CASE, WHEN, binary_expression(identifier, =, number), THEN, identifier, ELSE, NULL, END)": 234,
      "conditional_expression(CASE, WHEN, binary_expression(identifier, =, number), THEN, identifier, ELSE, identifier, END)": 235,
      "select_subexpression(select_statement(select_clause, from_clause, where_clause, order_by_clause, limit_clause))": 236,
      "join_clause(join_clause, JOIN, identifier, join_condition(ON, binary_expression(identifier, range_operator, identifier)))": 237,
      "binary_expression(binary_expression(identifier, arithmetic_operator, number), arithmetic_operator, function_call(NULLIF))": 238,
      "boolean_expression(binary_expression(identifier, =, identifier), AND, boolean_expression(boolean_expression, OR, in_expression))": 239,
      "boolean_expression(boolean_expression(binary_expression, AND, binary_expression), OR, boolean_expression(binary_expression, OR, boolean_expression))": 240,
      "boolean_expression(binary_expression(identifier, =, identifier), AND, exists_expression)": 241,
      "select_clause_body(binary_expression(binary_expression, arithmetic_operator, identifier))": 242,
      "boolean_expression(binary_expression(identifier, range_operator, identifier), AND, boolean_expression(binary_expression, OR, boolean_expression))": 243,
      "where_clause(WHERE, binary_expression(identifier, <>, string))": 244,
      "boolean_expression(binary_expression(identifier, =, string), AND, binary_expression(identifier, range_operator, number))": 245,
      "binary_expression(conditional_expression, range_operator, number)": 246,
      "conditional_expression(CASE, WHEN, binary_expression(identifier, range_operator, number), THEN, identifier, END)": 247,
      "boolean_expression(boolean_expression(boolean_expression, AND, is_expression), AND, is_expression)": 248,
      "select_subexpression(select_statement(select_clause, from_clause, order_by_clause))": 249,
      "boolean_expression(binary_expression(identifier, <>, string), AND, binary_expression(identifier, range_operator, number))": 250,
      "boolean_expression(binary_expression(identifier, <>, identifier), AND, binary_expression(identifier, range_operator, number))": 251,
      "boolean_expression(binary_expression(identifier, =, number), OR, boolean_expression(binary_expression, OR, binary_expression))": 252,
      "boolean_expression(binary_expression(identifier, range_operator, number), OR, boolean_expression(binary_expression, OR, in_expression))": 253,
      "boolean_expression(binary_expression(identifier, =, identifier), AND, boolean_expression(binary_expression, OR, is_expression))": 254,
      "boolean_expression(binary_expression(identifier, range_operator, number), OR, boolean_expression(binary_expression, AND, binary_expression))": 255,
      "select_clause_body(binary_expression(identifier, arithmetic_operator, identifier))": 256,
      "where_clause(WHERE, binary_expression(identifier, =, string))": 257,
      "boolean_expression(binary_expression(identifier, <>, number), OR, boolean_expression(binary_expression, OR, binary_expression))": 258,
      "boolean_expression(boolean_expression(binary_expression, OR, binary_expression), OR, is_expression)": 259,
      "binary_expression(binary_expression(binary_expression, arithmetic_operator, identifier), <>, number)": 260,
      "binary_expression(binary_expression(binary_expression, arithmetic_operator, identifier), =, number)": 261,
      "boolean_expression(boolean_expression(binary_expression, AND, binary_expression), AND, boolean_expression(binary_expression, OR, binary_expression))": 262,
      "boolean_expression(binary_expression(identifier, LIKE, string), OR, boolean_expression(binary_expression, OR, boolean_expression))": 263,
      "binary_expression(binary_expression(binary_expression, arithmetic_operator, number), arithmetic_operator, identifier)": 264,
      "boolean_expression(boolean_expression(binary_expression, AND, boolean_expression), AND, exists_expression)": 265,
      "binary_expression(binary_expression(identifier, arithmetic_operator, identifier), <>, number)": 266,
      "boolean_expression(boolean_expression(binary_expression, OR, binary_expression), OR, in_expression)": 267,
      "binary_expression(binary_expression(binary_expression, arithmetic_operator, function_call), range_operator, number)": 268,
      "binary_expression(binary_expression(function_call, arithmetic_operator, number), arithmetic_operator, identifier)": 269,
      "binary_expression(binary_expression(identifier, arithmetic_operator, identifier), =, number)": 270,
      "boolean_expression(binary_expression(identifier, =, identifier), AND, boolean_expression(binary_expression, OR, in_expression))": 271,
      "boolean_expression(binary_expression(identifier, range_operator, identifier), AND, boolean_expression(binary_expression, AND, boolean_expression))": 272,
      "group_by_clause(group_expression(rollup_clause))": 273,
      "binary_expression(binary_expression(identifier, arithmetic_operator, identifier), arithmetic_operator, number)": 274,
      "boolean_expression(binary_expression(identifier, range_operator, identifier), AND, is_expression)": 275,
      "select_statement(select_clause, from_clause, where_clause, group_by_clause)": 276,
      "boolean_expression(binary_expression(binary_expression, <>, number), AND, binary_expression(identifier, =, identifier))": 277,
      "where_clause(WHERE, boolean_expression(boolean_expression, AND, exists_expression))": 278,
      "boolean_expression(binary_expression(binary_expression, range_operator, number), AND, boolean_expression(binary_expression, AND, binary_expression))": 279,
      "boolean_expression(binary_expression(binary_expression, =, number), AND, binary_expression(identifier, =, identifier))": 280,
      "boolean_expression(boolean_expression(boolean_expression, AND, in_expression), AND, is_expression)": 281,
      "with_clause(cte(identifier, AS, select_statement(select_clause, from_clause, where_clause, group_by_clause)))": 282,
      "boolean_expression(binary_expression(identifier, <>, number), AND, binary_expression(identifier, range_operator, identifier))": 283,
      "boolean_expression(binary_expression(identifier, =, identifier), AND, boolean_expression(binary_expression, AND, is_expression))": 284,
      "boolean_expression(binary_expression(identifier, <>, number), AND, boolean_expression(boolean_expression, AND, is_expression))": 285,
      "where_clause(WHERE, binary_expression(identifier, LIKE, string))": 286,
      "boolean_expression(binary_expression(identifier, range_operator, identifier), AND, in_expression)": 287,
      "boolean_expression(boolean_expression(boolean_expression, AND, is_expression), AND, in_expression)": 288,
      "boolean_expression(binary_expression(binary_expression, range_operator, number), OR, binary_expression(identifier, range_operator, number))": 289,
      "binary_expression(binary_expression(identifier, arithmetic_operator, number), arithmetic_operator, number)": 290,
      "boolean_expression(binary_expression(identifier, =, number), AND, boolean_expression(boolean_expression, AND, is_expression))": 291,
      "boolean_expression(binary_expression(identifier, =, number), AND, binary_expression(identifier, range_operator, identifier))": 292,
      "select_clause_body(binary_expression(binary_expression, arithmetic_operator, number))": 293,
      "select_subexpression(select_statement(select_clause, from_clause, order_by_clause, limit_clause))": 294,
      "boolean_expression(binary_expression(identifier, range_operator, number), AND, boolean_expression(binary_expression, AND, exists_expression))": 295,
      "boolean_expression(boolean_expression(NOT, in_expression), AND, boolean_expression(NOT, is_expression))": 296,
      "boolean_expression(binary_expression(identifier, =, identifier), AND, boolean_expression(boolean_expression, AND, is_expression))": 297,
      "join_clause(identifier, JOIN, identifier, join_condition(ON, boolean_expression(boolean_expression, AND, exists_expression)))": 298,
      "boolean_expression(boolean_expression(binary_expression, AND, is_expression), AND, is_expression)": 299,
      "binary_expression(binary_expression(function_call, arithmetic_operator, identifier), arithmetic_operator, identifier)": 300,
      "binary_expression(binary_expression(binary_expression, arithmetic_operator, binary_expression), range_operator, number)": 301,
      "boolean_expression(binary_expression(identifier, LIKE, string), OR, binary_expression(identifier, range_operator, number))": 302,
      "rollup_clause(ROLLUP, identifier, identifier)": 303,
      "boolean_expression(binary_expression(identifier, <>, string), AND, boolean_expression(boolean_expression, AND, is_expression))": 304,
      "boolean_expression(binary_expression(identifier, =, string), AND, boolean_expression(boolean_expression, AND, is_expression))": 305,
      "boolean_expression(binary_expression(identifier, =, identifier), AND, boolean_expression(binary_expression, AND, in_expression))": 306,
      "where_clause(WHERE, boolean_expression(boolean_expression, AND, in_expression))": 307,
      "conditional_expression(CASE, WHEN, binary_expression(identifier, range_operator, number), THEN, identifier, ELSE, number, END)": 308,
      "conditional_expression(CASE, WHEN, binary_expression(identifier, range_operator, number), THEN, identifier, ELSE, identifier, END)": 309,
      "where_clause(WHERE, boolean_expression(boolean_expression, AND, boolean_expression))": 310,
      "where_clause(WHERE, boolean_expression(boolean_expression, AND, is_expression))": 311,
      "boolean_expression(boolean_expression(boolean_expression, AND, in_expression), AND, in_expression)": 312,
      "boolean_expression(binary_expression(identifier, <>, number), AND, binary_expression(identifier, =, number))": 313,
      "where_clause(WHERE, boolean_expression(boolean_expression, OR, boolean_expression))": 314,
      "boolean_expression(binary_expression(identifier, =, string), OR, boolean_expression(binary_expression, OR, binary_expression))": 315,
      "boolean_expression(boolean_expression(binary_expression, AND, in_expression), AND, is_expression)": 316,
      "select_statement(select_clause, from_clause, where_clause, group_by_clause, limit_clause)": 317,
      "conditional_expression(CASE, WHEN, binary_expression(identifier, range_operator, number), THEN, identifier, ELSE, NULL, END)": 318,
      "boolean_expression(binary_expression(identifier, <>, number), AND, boolean_expression(boolean_expression, AND, in_expression))": 319,
      "boolean_expression(binary_expression(identifier, LIKE, string), AND, binary_expression(identifier, range_operator, number))": 320,
      "boolean_expression(binary_expression(identifier, =, number), AND, boolean_expression(boolean_expression, AND, in_expression))": 321,
      "having_clause(HAVING, binary_expression(identifier, <>, number))": 322,
      "boolean_expression(boolean_expression(binary_expression, AND, is_expression), AND, in_expression)": 323,
      "boolean_expression(binary_expression(identifier, <>, number), OR, binary_expression(identifier, =, number))": 324,
      "boolean_expression(binary_expression(identifier, range_operator, number), AND, boolean_expression(binary_expression, OR, binary_expression))": 325,
      "boolean_expression(binary_expression(identifier, <>, string), OR, boolean_expression(binary_expression, OR, binary_expression))": 326,
      "having_clause(HAVING, binary_expression(identifier, =, number))": 327,
      "select_statement(select_clause, from_clause, where_clause, group_by_clause, order_by_clause)": 328,
      "with_clause(cte(identifier, AS, select_statement(select_clause, from_clause, where_clause, group_by_clause, limit_clause)))": 329,
      "with_clause(cte(identifier, AS, select_statement(select_clause, from_clause, where_clause, group_by_clause, order_by_clause)))": 330,
      "boolean_expression(binary_expression(identifier, range_operator, identifier), AND, boolean_expression(binary_expression, OR, binary_expression))": 331,
      "boolean_expression(binary_expression(identifier, range_operator, number), OR, boolean_expression(NOT, binary_expression))": 332,
      "select_statement(select_clause, from_clause, group_by_clause)": 333,
      "boolean_expression(binary_expression(binary_expression, range_operator, number), AND, binary_expression(identifier, range_operator, number))": 334,
      "boolean_expression(binary_expression(identifier, =, number), OR, is_expression)": 335,
      "boolean_expression(boolean_expression(NOT, is_expression), AND, boolean_expression(NOT, is_expression))": 336,
      "from_clause(join_table_5)": 337,
      "boolean_expression(binary_expression(identifier, =, identifier), AND, boolean_expression(boolean_expression, AND, in_expression))": 338,
      "boolean_expression(binary_expression(identifier, range_operator, identifier), AND, boolean_expression(NOT, is_expression))": 339,
      "boolean_expression(boolean_expression(binary_expression, AND, in_expression), AND, in_expression)": 340,
      "boolean_expression(binary_expression(identifier, =, string), AND, boolean_expression(boolean_expression, AND, in_expression))": 341,
      "boolean_expression(binary_expression(binary_expression, <>, number), AND, boolean_expression(binary_expression, AND, boolean_expression))": 342,
      "boolean_expression(binary_expression(binary_expression, =, number), AND, boolean_expression(binary_expression, AND, boolean_expression))": 343,
      "boolean_expression(binary_expression(identifier, <>, number), OR, is_expression)": 344,
      "binary_expression(identifier, =, time)": 345,
      "join_clause(identifier, JOIN, identifier, join_condition(ON, binary_expression(identifier, <>, identifier)))": 346,
      "boolean_expression(binary_expression(identifier, range_operator, identifier), AND, boolean_expression(boolean_expression, AND, boolean_expression))": 347,
      "boolean_expression(binary_expression(identifier, <>, string), AND, boolean_expression(boolean_expression, AND, in_expression))": 348,
      "boolean_expression(binary_expression(identifier, =, number), AND, boolean_expression(binary_expression, AND, is_expression))": 349,
      "boolean_expression(binary_expression(identifier, <>, number), AND, boolean_expression(binary_expression, AND, is_expression))": 350,
      "with_clause(cte(identifier, AS, select_statement(select_clause, from_clause, group_by_clause)))": 351,
      "boolean_expression(binary_expression(identifier, range_operator, number), AND, boolean_expression(NOT, binary_expression))": 352,
      "binary_expression(identifier, <>, time)": 353,
      "boolean_expression(binary_expression(identifier, <>, string), AND, binary_expression(identifier, range_operator, identifier))": 354,
      "boolean_expression(binary_expression(identifier, <>, number), OR, in_expression)": 355,
      "boolean_expression(binary_expression(identifier, =, number), AND, in_expression)": 356,
      "boolean_expression(binary_expression(identifier, =, number), OR, in_expression)": 357,
      "boolean_expression(in_expression, OR, is_expression)": 358,
      "boolean_expression(binary_expression(identifier, =, string), AND, binary_expression(identifier, range_operator, identifier))": 359,
      "boolean_expression(binary_expression(identifier, =, number), AND, is_expression)": 360,
      "boolean_expression(binary_expression(binary_expression, range_operator, number), OR, boolean_expression(binary_expression, OR, boolean_expression))": 361,
      "boolean_expression(binary_expression(identifier, =, number), AND, boolean_expression(binary_expression, AND, in_expression))": 362,
      "boolean_expression(binary_expression(identifier, <>, number), AND, boolean_expression(binary_expression, AND, in_expression))": 363,
      "binary_expression(binary_expression(identifier, arithmetic_operator, identifier), arithmetic_operator, function_call(NULLIF))": 364,
      "boolean_expression(binary_expression(identifier, range_operator, identifier), AND, boolean_expression(binary_expression, AND, binary_expression))": 365,
      "boolean_expression(binary_expression(identifier, <>, number), AND, is_expression)": 366,
      "boolean_expression(binary_expression(identifier, range_operator, identifier), AND, boolean_expression(NOT, in_expression))": 367,
      "binary_expression(binary_expression(identifier, arithmetic_operator, number), arithmetic_operator, binary_expression(identifier, arithmetic_operator, number))": 368,
      "boolean_expression(binary_expression(identifier, <>, number), AND, in_expression)": 369,
      "boolean_expression(binary_expression(identifier, <>, number), AND, boolean_expression(NOT, exists_expression))": 370,
      "select_statement(select_clause, from_clause, where_clause, group_by_clause, order_by_clause, limit_clause)": 371,
      "boolean_expression(binary_expression(identifier, =, number), AND, boolean_expression(NOT, exists_expression))": 372,
      "boolean_expression(boolean_expression(boolean_expression, OR, is_expression), OR, is_expression)": 373,
      "boolean_expression(boolean_expression(binary_expression, OR, binary_expression), AND, boolean_expression(binary_expression, OR, boolean_expression))": 374,
      "boolean_expression(in_expression, AND, is_expression)": 375,
      "select_statement(select_clause, from_clause, group_by_clause, limit_clause)": 376,
      "boolean_expression(binary_expression(identifier, range_operator, number), OR, boolean_expression(binary_expression, AND, boolean_expression))": 377,
      "boolean_expression(boolean_expression(NOT, exists_expression), AND, boolean_expression(NOT, is_expression))": 378,
      "boolean_expression(binary_expression(identifier, =, number), AND, exists_expression)": 379,
      "binary_expression(binary_expression(function_call, arithmetic_operator, identifier), =, number)": 380,
      "boolean_expression(binary_expression(identifier, <>, number), AND, exists_expression)": 381,
      "boolean_expression(boolean_expression(binary_expression, OR, binary_expression), AND, boolean_expression(binary_expression, OR, binary_expression))": 382,
      "boolean_expression(binary_expression(identifier, LIKE, string), OR, boolean_expression(binary_expression, OR, binary_expression))": 383,
      "select_clause_body(binary_expression(function_call, arithmetic_operator, identifier))": 384,
      "boolean_expression(binary_expression(identifier, LIKE, string), AND, boolean_expression(boolean_expression, AND, is_expression))": 385,
      "boolean_expression(boolean_expression(binary_expression, AND, binary_expression), OR, boolean_expression(binary_expression, OR, binary_expression))": 386,
      "with_clause(cte(identifier, AS, select_statement(select_clause, from_clause, where_clause, group_by_clause, order_by_clause, limit_clause)))": 387,
      "select_subexpression(select_statement(select_clause, from_clause, where_clause, group_by_clause))": 388,
      "boolean_expression(binary_expression(identifier, =, string), AND, boolean_expression(binary_expression, AND, is_expression))": 389,
      "boolean_expression(boolean_expression(binary_expression, AND, binary_expression), AND, exists_expression)": 390,
      "boolean_expression(binary_expression(identifier, =, number), OR, boolean_expression(NOT, is_expression))": 391,
      "boolean_expression(binary_expression(identifier, <>, number), OR, boolean_expression(NOT, is_expression))": 392,
      "select_statement(select_clause, from_clause, group_by_clause, order_by_clause)": 393,
      "binary_expression(binary_expression(function_call, arithmetic_operator, identifier), <>, number)": 394,
      "boolean_expression(binary_expression(identifier, <>, string), AND, boolean_expression(binary_expression, AND, is_expression))": 395,
      "boolean_expression(boolean_expression(NOT, in_expression), OR, boolean_expression(NOT, is_expression))": 396,
      "boolean_expression(boolean_expression(NOT, exists_expression), AND, boolean_expression(NOT, in_expression))": 397,
      "having_clause(HAVING, boolean_expression(binary_expression, AND, binary_expression))": 398,
      "boolean_expression(boolean_expression(boolean_expression, AND, boolean_expression), AND, is_expression)": 399,
      "boolean_expression(boolean_expression(binary_expression, AND, boolean_expression), AND, boolean_expression(binary_expression, OR, is_expression))": 400,
      "boolean_expression(binary_expression(identifier, <>, number), AND, binary_expression(identifier, <>, number))": 401,
      "boolean_expression(boolean_expression(boolean_expression, OR, in_expression), OR, is_expression)": 402,
      "binary_expression(binary_expression(binary_expression, arithmetic_operator, number), range_operator, number)": 403,
      "boolean_expression(binary_expression(identifier, =, identifier), AND, boolean_expression(boolean_expression, OR, boolean_expression))": 404,
      "with_clause(cte(identifier, AS, select_statement(select_clause, from_clause, group_by_clause, limit_clause)))": 405,
      "boolean_expression(boolean_expression(boolean_expression, OR, is_expression), OR, in_expression)": 406,
      "boolean_expression(binary_expression(identifier, =, number), AND, boolean_expression(boolean_expression, AND, boolean_expression))": 407,
      "binary_expression(binary_expression(binary_expression, arithmetic_operator, function_call), arithmetic_operator, identifier)": 408,
      "where_clause(WHERE, boolean_expression(boolean_expression, OR, is_expression))": 409,
      "binary_expression(binary_expression(function_call, arithmetic_operator, identifier), arithmetic_operator, number)": 410,
      "boolean_expression(binary_expression(identifier, LIKE, string), AND, boolean_expression(boolean_expression, AND, in_expression))": 411,
      "boolean_expression(binary_expression(identifier, LIKE, string), AND, binary_expression(identifier, range_operator, identifier))": 412,
      "select_statement(with_clause, select_clause, from_clause, where_clause, group_by_clause)": 413,
      "binary_expression(conditional_expression, =, number)": 414,
      "boolean_expression(binary_expression(identifier, =, number), OR, boolean_expression(boolean_expression, OR, is_expression))": 415,
      "boolean_expression(boolean_expression(NOT, binary_expression), AND, boolean_expression(NOT, is_expression))": 416,
      "where_clause(WHERE, binary_expression(identifier, range_operator, time))": 417,
      "join_clause(join_clause, JOIN, identifier, join_condition(ON, binary_expression(identifier, <>, identifier)))": 418,
      "boolean_expression(binary_expression(binary_expression, range_operator, number), AND, binary_expression(identifier, range_operator, identifier))": 419,
      "boolean_expression(binary_expression(identifier, =, number), AND, boolean_expression(NOT, is_expression))": 420,
      "boolean_expression(binary_expression(identifier, <>, number), AND, boolean_expression(NOT, is_expression))": 421,
      "where_clause(WHERE, boolean_expression(NOT, binary_expression))": 422,
      "boolean_expression(binary_expression(identifier, range_operator, number), AND, boolean_expression(binary_expression, OR, boolean_expression))": 423,
      "boolean_expression(binary_expression(identifier, <>, number), OR, boolean_expression(boolean_expression, OR, is_expression))": 424,
      "boolean_expression(binary_expression(identifier, <>, number), OR, binary_expression(identifier, <>, number))": 425,
      "boolean_expression(binary_expression(identifier, <>, number), AND, boolean_expression(boolean_expression, AND, boolean_expression))": 426,
      "boolean_expression(boolean_expression(boolean_expression, AND, boolean_expression), AND, boolean_expression(boolean_expression, OR, is_expression))": 427,
      "boolean_expression(binary_expression(identifier, =, number), AND, binary_expression(identifier, =, number))": 428,
      "boolean_expression(binary_expression(identifier, =, number), OR, boolean_expression(NOT, in_expression))": 429,
      "boolean_expression(binary_expression(identifier, =, string), AND, boolean_expression(binary_expression, AND, in_expression))": 430,
      "boolean_expression(binary_expression(identifier, <>, number), OR, boolean_expression(NOT, in_expression))": 431,
      "boolean_expression(binary_expression(identifier, range_operator, time), AND, boolean_expression(binary_expression, AND, boolean_expression))": 432,
      "boolean_expression(binary_expression(identifier, <>, identifier), AND, boolean_expression(binary_expression, OR, boolean_expression))": 433,
      "boolean_expression(binary_expression(identifier, <>, string), AND, boolean_expression(binary_expression, AND, in_expression))": 434,
      "boolean_expression(binary_expression(identifier, =, number), OR, boolean_expression(boolean_expression, OR, in_expression))": 435,
      "with_clause(cte(identifier, AS, select_statement(select_clause, from_clause, group_by_clause, order_by_clause)))": 436,
      "conditional_expression(CASE, identifier, WHEN, number, THEN, identifier, END)": 437,
      "boolean_expression(is_expression, OR, is_expression)": 438,
      "binary_expression(conditional_expression, <>, number)": 439,
      "boolean_expression(binary_expression(identifier, =, number), OR, binary_expression(identifier, =, number))": 440,
      "boolean_expression(boolean_expression(binary_expression, AND, boolean_expression), AND, boolean_expression(binary_expression, OR, in_expression))": 441,
